remotemcu/remcu-chip-sdks/SAM/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/aon_pwr_seq.h
/**
 * \file
 *
 * \brief Component description for AON_PWR_SEQ
 *
 * Copyright (c) 2015-2018 Microchip Technology Inc. and its subsidiaries.
 *
 * \asf_license_start
 *
 * \page License
 *
 * Subject to your compliance with these terms, you may use Microchip
 * software and any derivatives exclusively with Microchip products.
 * It is your responsibility to comply with third party license terms applicable
 * to your use of third party software (including open source software) that
 * may accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES,
 * WHETHER EXPRESS, IMPLIED OR STATUTORY, APPLY TO THIS SOFTWARE,
 * INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY,
 * AND FITNESS FOR A PARTICULAR PURPOSE. IN NO EVENT WILL MICROCHIP BE
 * LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE
 * SOFTWARE, HOWEVER CAUSED, EVEN IF MICROCHIP HAS BEEN ADVISED OF THE
 * POSSIBILITY OR THE DAMAGES ARE FORESEEABLE.  TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY
 * RELATED TO THIS SOFTWARE WILL NOT EXCEED THE AMOUNT OF FEES, IF ANY,
 * THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 * \asf_license_stop
 *
 */

#ifndef _SAMB11_AON_PWR_SEQ_COMPONENT_
#define _SAMB11_AON_PWR_SEQ_COMPONENT_

/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR AON_PWR_SEQ */
/* ========================================================================== */
/** \addtogroup SAMB11_AON_PWR_SEQ Always On Power Sequencer 
 *  @{
 */

#ifndef COMPONENT_TYPEDEF_STYLE
  #define COMPONENT_TYPEDEF_STYLE 'N'  /**< Defines default style of typedefs for the component header files ('R' = RFO, 'N' = NTO*/
#endif

#define AON_PWR_SEQ_AONPS1234
#define REV_AON_PWR_SEQ                  0x100

/* -------- AON_PWR_SEQ_GPIO_WAKEUP_CTRL : (AON_PWR_SEQ Offset: 0x00) (R/W 8) Controls the wakeup enable for GPIO_0, GPIO_1 and GPIO_2 (Pinmux will control the ARM wakeup) -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  :1;                        /**< bit:      0  Reserved */
    uint8_t  BLE_ENABLE:1;              /**< bit:      1  If set, this will enable GPIO_0 to wake up the BLE domain (PD4, PD5 and PD6) */
    uint8_t  :6;                        /**< bit:   2..7  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} AON_PWR_SEQ_GPIO_WAKEUP_CTRL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define AON_PWR_SEQ_GPIO_WAKEUP_CTRL_OFFSET 0x00                                          /**<  (AON_PWR_SEQ_GPIO_WAKEUP_CTRL) Controls the wakeup enable for GPIO_0, GPIO_1 and GPIO_2 (Pinmux will control the ARM wakeup)  Offset */
#define AON_PWR_SEQ_GPIO_WAKEUP_CTRL_RESETVALUE 0x02u                                         /**<  (AON_PWR_SEQ_GPIO_WAKEUP_CTRL) Controls the wakeup enable for GPIO_0, GPIO_1 and GPIO_2 (Pinmux will control the ARM wakeup)  Reset Value */

#define AON_PWR_SEQ_GPIO_WAKEUP_CTRL_BLE_ENABLE_Pos 1                                              /**< (AON_PWR_SEQ_GPIO_WAKEUP_CTRL) If set, this will enable GPIO_0 to wake up the BLE domain (PD4, PD5 and PD6) Position */
#define AON_PWR_SEQ_GPIO_WAKEUP_CTRL_BLE_ENABLE_Msk (0x1u << AON_PWR_SEQ_GPIO_WAKEUP_CTRL_BLE_ENABLE_Pos)  /**< (AON_PWR_SEQ_GPIO_WAKEUP_CTRL) If set, this will enable GPIO_0 to wake up the BLE domain (PD4, PD5 and PD6) Mask */
#define AON_PWR_SEQ_GPIO_WAKEUP_CTRL_BLE_ENABLE AON_PWR_SEQ_GPIO_WAKEUP_CTRL_BLE_ENABLE_Msk    /**< \deprecated Old style mask definition for 1 bit bitfield. Use AON_PWR_SEQ_GPIO_WAKEUP_CTRL_BLE_ENABLE_Msk instead */
#define AON_PWR_SEQ_GPIO_WAKEUP_CTRL_MASK   0x02u                                          /**< \deprecated (AON_PWR_SEQ_GPIO_WAKEUP_CTRL) Register MASK  (Use AON_PWR_SEQ_GPIO_WAKEUP_CTRL_Msk instead)  */
#define AON_PWR_SEQ_GPIO_WAKEUP_CTRL_Msk    0x02u                                          /**< (AON_PWR_SEQ_GPIO_WAKEUP_CTRL) Register Mask  */

/* -------- AON_PWR_SEQ_AON_ST_WAKEUP_CTRL : (AON_PWR_SEQ Offset: 0x0c) (R/W 8) Controls the wakeup enable for the Always On Sleep Timer (AON_ST) -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  ARM_ENABLE:1;              /**< bit:      0  If set, this will enable the AON_ST to wake up the ARM domain (PD1, PD2 and PD3) */
    uint8_t  BLE_ENABLE:1;              /**< bit:      1  If set, this will enable the AON_ST to wake up the BLE domain (PD4, PD5 and PD6) */
    uint8_t  :6;                        /**< bit:   2..7  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} AON_PWR_SEQ_AON_ST_WAKEUP_CTRL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define AON_PWR_SEQ_AON_ST_WAKEUP_CTRL_OFFSET 0x0C                                          /**<  (AON_PWR_SEQ_AON_ST_WAKEUP_CTRL) Controls the wakeup enable for the Always On Sleep Timer (AON_ST)  Offset */
#define AON_PWR_SEQ_AON_ST_WAKEUP_CTRL_RESETVALUE 0x00u                                         /**<  (AON_PWR_SEQ_AON_ST_WAKEUP_CTRL) Controls the wakeup enable for the Always On Sleep Timer (AON_ST)  Reset Value */

#define AON_PWR_SEQ_AON_ST_WAKEUP_CTRL_ARM_ENABLE_Pos 0                                              /**< (AON_PWR_SEQ_AON_ST_WAKEUP_CTRL) If set, this will enable the AON_ST to wake up the ARM domain (PD1, PD2 and PD3) Position */
#define AON_PWR_SEQ_AON_ST_WAKEUP_CTRL_ARM_ENABLE_Msk (0x1u << AON_PWR_SEQ_AON_ST_WAKEUP_CTRL_ARM_ENABLE_Pos)  /**< (AON_PWR_SEQ_AON_ST_WAKEUP_CTRL) If set, this will enable the AON_ST to wake up the ARM domain (PD1, PD2 and PD3) Mask */
#define AON_PWR_SEQ_AON_ST_WAKEUP_CTRL_ARM_ENABLE AON_PWR_SEQ_AON_ST_WAKEUP_CTRL_ARM_ENABLE_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use AON_PWR_SEQ_AON_ST_WAKEUP_CTRL_ARM_ENABLE_Msk instead */
#define AON_PWR_SEQ_AON_ST_WAKEUP_CTRL_BLE_ENABLE_Pos 1                                              /**< (AON_PWR_SEQ_AON_ST_WAKEUP_CTRL) If set, this will enable the AON_ST to wake up the BLE domain (PD4, PD5 and PD6) Position */
#define AON_PWR_SEQ_AON_ST_WAKEUP_CTRL_BLE_ENABLE_Msk (0x1u << AON_PWR_SEQ_AON_ST_WAKEUP_CTRL_BLE_ENABLE_Pos)  /**< (AON_PWR_SEQ_AON_ST_WAKEUP_CTRL) If set, this will enable the AON_ST to wake up the BLE domain (PD4, PD5 and PD6) Mask */
#define AON_PWR_SEQ_AON_ST_WAKEUP_CTRL_BLE_ENABLE AON_PWR_SEQ_AON_ST_WAKEUP_CTRL_BLE_ENABLE_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use AON_PWR_SEQ_AON_ST_WAKEUP_CTRL_BLE_ENABLE_Msk instead */
#define AON_PWR_SEQ_AON_ST_WAKEUP_CTRL_MASK 0x03u                                          /**< \deprecated (AON_PWR_SEQ_AON_ST_WAKEUP_CTRL) Register MASK  (Use AON_PWR_SEQ_AON_ST_WAKEUP_CTRL_Msk instead)  */
#define AON_PWR_SEQ_AON_ST_WAKEUP_CTRL_Msk  0x03u                                          /**< (AON_PWR_SEQ_AON_ST_WAKEUP_CTRL) Register Mask  */

/* -------- AON_PWR_SEQ_LPMCU_WAKEUP_CTRL : (AON_PWR_SEQ Offset: 0x10) (R/W 16) Controls the wakeup enable for the Low Power Micro Controller Unit (LPMCU) -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint16_t :6;                        /**< bit:   0..5  Reserved */
    uint16_t BLE_ENABLE:1;              /**< bit:      6  If set, this will enable the LPMCU to wake up the BLE domain (PD4, PD5 and PD6) */
    uint16_t :2;                        /**< bit:   7..8  Reserved */
    uint16_t PD7_ENABLE:1;              /**< bit:      9  If set, this will enable the LPMCU to wakeup the PD7 domain (EFUSE) */
    uint16_t :6;                        /**< bit: 10..15  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint16_t reg;                         /**< Type used for register access */
} AON_PWR_SEQ_LPMCU_WAKEUP_CTRL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define AON_PWR_SEQ_LPMCU_WAKEUP_CTRL_OFFSET 0x10                                          /**<  (AON_PWR_SEQ_LPMCU_WAKEUP_CTRL) Controls the wakeup enable for the Low Power Micro Controller Unit (LPMCU)  Offset */
#define AON_PWR_SEQ_LPMCU_WAKEUP_CTRL_RESETVALUE 0x00u                                         /**<  (AON_PWR_SEQ_LPMCU_WAKEUP_CTRL) Controls the wakeup enable for the Low Power Micro Controller Unit (LPMCU)  Reset Value */

