remotemcu/remcu-chip-sdks/SAM/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/aon_pwr_seq.h
#define AON_PWR_SEQ_LPMCU_WAKEUP_CTRL_BLE_ENABLE_Pos 6                                              /**< (AON_PWR_SEQ_LPMCU_WAKEUP_CTRL) If set, this will enable the LPMCU to wake up the BLE domain (PD4, PD5 and PD6) Position */
#define AON_PWR_SEQ_LPMCU_WAKEUP_CTRL_BLE_ENABLE_Msk (0x1u << AON_PWR_SEQ_LPMCU_WAKEUP_CTRL_BLE_ENABLE_Pos)  /**< (AON_PWR_SEQ_LPMCU_WAKEUP_CTRL) If set, this will enable the LPMCU to wake up the BLE domain (PD4, PD5 and PD6) Mask */
#define AON_PWR_SEQ_LPMCU_WAKEUP_CTRL_BLE_ENABLE AON_PWR_SEQ_LPMCU_WAKEUP_CTRL_BLE_ENABLE_Msk   /**< \deprecated Old style mask definition for 1 bit bitfield. Use AON_PWR_SEQ_LPMCU_WAKEUP_CTRL_BLE_ENABLE_Msk instead */
#define AON_PWR_SEQ_LPMCU_WAKEUP_CTRL_PD7_ENABLE_Pos 9                                              /**< (AON_PWR_SEQ_LPMCU_WAKEUP_CTRL) If set, this will enable the LPMCU to wakeup the PD7 domain (EFUSE) Position */
#define AON_PWR_SEQ_LPMCU_WAKEUP_CTRL_PD7_ENABLE_Msk (0x1u << AON_PWR_SEQ_LPMCU_WAKEUP_CTRL_PD7_ENABLE_Pos)  /**< (AON_PWR_SEQ_LPMCU_WAKEUP_CTRL) If set, this will enable the LPMCU to wakeup the PD7 domain (EFUSE) Mask */
#define AON_PWR_SEQ_LPMCU_WAKEUP_CTRL_PD7_ENABLE AON_PWR_SEQ_LPMCU_WAKEUP_CTRL_PD7_ENABLE_Msk   /**< \deprecated Old style mask definition for 1 bit bitfield. Use AON_PWR_SEQ_LPMCU_WAKEUP_CTRL_PD7_ENABLE_Msk instead */
#define AON_PWR_SEQ_LPMCU_WAKEUP_CTRL_MASK  0x240u                                         /**< \deprecated (AON_PWR_SEQ_LPMCU_WAKEUP_CTRL) Register MASK  (Use AON_PWR_SEQ_LPMCU_WAKEUP_CTRL_Msk instead)  */
#define AON_PWR_SEQ_LPMCU_WAKEUP_CTRL_Msk   0x240u                                         /**< (AON_PWR_SEQ_LPMCU_WAKEUP_CTRL) Register Mask  */

/* -------- AON_PWR_SEQ_BLE_ST_WAKEUP_CTRL : (AON_PWR_SEQ Offset: 0x14) (R/W 8) Controls the wakeup enable for the BLE Sleep Timer (BLE_ST) -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  ARM_ENABLE:1;              /**< bit:      0  If set, this will enable the BLE_ST to wake up the ARM domain */
    uint8_t  BLE_ENABLE:1;              /**< bit:      1  If set, this will enable the BLE_ST to wake up the BLE domain */
    uint8_t  :6;                        /**< bit:   2..7  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} AON_PWR_SEQ_BLE_ST_WAKEUP_CTRL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define AON_PWR_SEQ_BLE_ST_WAKEUP_CTRL_OFFSET 0x14                                          /**<  (AON_PWR_SEQ_BLE_ST_WAKEUP_CTRL) Controls the wakeup enable for the BLE Sleep Timer (BLE_ST)  Offset */
#define AON_PWR_SEQ_BLE_ST_WAKEUP_CTRL_RESETVALUE 0x00u                                         /**<  (AON_PWR_SEQ_BLE_ST_WAKEUP_CTRL) Controls the wakeup enable for the BLE Sleep Timer (BLE_ST)  Reset Value */

#define AON_PWR_SEQ_BLE_ST_WAKEUP_CTRL_ARM_ENABLE_Pos 0                                              /**< (AON_PWR_SEQ_BLE_ST_WAKEUP_CTRL) If set, this will enable the BLE_ST to wake up the ARM domain Position */
#define AON_PWR_SEQ_BLE_ST_WAKEUP_CTRL_ARM_ENABLE_Msk (0x1u << AON_PWR_SEQ_BLE_ST_WAKEUP_CTRL_ARM_ENABLE_Pos)  /**< (AON_PWR_SEQ_BLE_ST_WAKEUP_CTRL) If set, this will enable the BLE_ST to wake up the ARM domain Mask */
#define AON_PWR_SEQ_BLE_ST_WAKEUP_CTRL_ARM_ENABLE AON_PWR_SEQ_BLE_ST_WAKEUP_CTRL_ARM_ENABLE_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use AON_PWR_SEQ_BLE_ST_WAKEUP_CTRL_ARM_ENABLE_Msk instead */
#define AON_PWR_SEQ_BLE_ST_WAKEUP_CTRL_BLE_ENABLE_Pos 1                                              /**< (AON_PWR_SEQ_BLE_ST_WAKEUP_CTRL) If set, this will enable the BLE_ST to wake up the BLE domain Position */
#define AON_PWR_SEQ_BLE_ST_WAKEUP_CTRL_BLE_ENABLE_Msk (0x1u << AON_PWR_SEQ_BLE_ST_WAKEUP_CTRL_BLE_ENABLE_Pos)  /**< (AON_PWR_SEQ_BLE_ST_WAKEUP_CTRL) If set, this will enable the BLE_ST to wake up the BLE domain Mask */
#define AON_PWR_SEQ_BLE_ST_WAKEUP_CTRL_BLE_ENABLE AON_PWR_SEQ_BLE_ST_WAKEUP_CTRL_BLE_ENABLE_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use AON_PWR_SEQ_BLE_ST_WAKEUP_CTRL_BLE_ENABLE_Msk instead */
#define AON_PWR_SEQ_BLE_ST_WAKEUP_CTRL_MASK 0x03u                                          /**< \deprecated (AON_PWR_SEQ_BLE_ST_WAKEUP_CTRL) Register MASK  (Use AON_PWR_SEQ_BLE_ST_WAKEUP_CTRL_Msk instead)  */
#define AON_PWR_SEQ_BLE_ST_WAKEUP_CTRL_Msk  0x03u                                          /**< (AON_PWR_SEQ_BLE_ST_WAKEUP_CTRL) Register Mask  */

/* -------- AON_PWR_SEQ_LPMCU_SLEEP_1_CTRL : (AON_PWR_SEQ Offset: 0x20) (R/W 32) Controls the sleep and retention options for SLEEP request 1 from the ARM -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t ARM_SLEEP_EN:1;            /**< bit:      0  Enables the SLEEP request 1 to put all ARM domains in sleep or retention (PD1, PD2A, PD2B, PD3, PD8).  PD7 has its own control */
    uint32_t :5;                        /**< bit:   1..5  Reserved */
    uint32_t BLE_SLEEP_EN:1;            /**< bit:      6  Enables the SLEEP request 1 to put PD4 domain in sleep (BLE Core) and PD5 (BLE memories) in sleep or retention */
    uint32_t :1;                        /**< bit:      7  Reserved */
    uint32_t PD6_SLEEP_EN:1;            /**< bit:      8  Enables the SLEEP request 1 to put PD6 domain in sleep (BLE Sleep Timer) */
    uint32_t PD7_SLEEP_EN:1;            /**< bit:      9  Enables the SLEEP request 1 to put PD7 domain in sleep (EFUSE) */
    uint32_t :6;                        /**< bit: 10..15  Reserved */
    uint32_t PD2A_RETENTION_EN:1;       /**< bit:     16  If 1, then PD2A will be put in retention mode when instructed to go to sleep (First ARM Memory 16K) */
    uint32_t PD2B_RETENTION_EN:1;       /**< bit:     17  If 1, then PD2B will be put in retention mode when instructed to go to sleep (Second ARM Memory 16K) */
    uint32_t PD3_RETENTION_EN:1;        /**< bit:     18  If 1, then PD3 will be put in retention mode when instructed to go to sleep (Third, Fourth and Fifth ARM Memories 3x32K = 96K) */
    uint32_t :2;                        /**< bit: 19..20  Reserved */
    uint32_t PD5_RETENTION_EN:1;        /**< bit:     21  If 1, then PD5 will be put in retention mode when instructed to go to sleep (BLE Retention Memory) */
    uint32_t PD8_RETENTION_EN:1;        /**< bit:     22  If 1, then PD8 will be put in retention mode when instructed to go to sleep (BLE LP Memory) */
    uint32_t :9;                        /**< bit: 23..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} AON_PWR_SEQ_LPMCU_SLEEP_1_CTRL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define AON_PWR_SEQ_LPMCU_SLEEP_1_CTRL_OFFSET 0x20                                          /**<  (AON_PWR_SEQ_LPMCU_SLEEP_1_CTRL) Controls the sleep and retention options for SLEEP request 1 from the ARM  Offset */
#define AON_PWR_SEQ_LPMCU_SLEEP_1_CTRL_RESETVALUE 0x00u                                         /**<  (AON_PWR_SEQ_LPMCU_SLEEP_1_CTRL) Controls the sleep and retention options for SLEEP request 1 from the ARM  Reset Value */

