remotemcu/remcu-chip-sdks/SAM/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/aon_pwr_seq.h
#define AON_PWR_SEQ_LPMCU_SLEEP_1_CTRL_ARM_SLEEP_EN_Pos 0                                              /**< (AON_PWR_SEQ_LPMCU_SLEEP_1_CTRL) Enables the SLEEP request 1 to put all ARM domains in sleep or retention (PD1, PD2A, PD2B, PD3, PD8).  PD7 has its own control Position */
#define AON_PWR_SEQ_LPMCU_SLEEP_1_CTRL_ARM_SLEEP_EN_Msk (0x1u << AON_PWR_SEQ_LPMCU_SLEEP_1_CTRL_ARM_SLEEP_EN_Pos)  /**< (AON_PWR_SEQ_LPMCU_SLEEP_1_CTRL) Enables the SLEEP request 1 to put all ARM domains in sleep or retention (PD1, PD2A, PD2B, PD3, PD8).  PD7 has its own control Mask */
#define AON_PWR_SEQ_LPMCU_SLEEP_1_CTRL_ARM_SLEEP_EN AON_PWR_SEQ_LPMCU_SLEEP_1_CTRL_ARM_SLEEP_EN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use AON_PWR_SEQ_LPMCU_SLEEP_1_CTRL_ARM_SLEEP_EN_Msk instead */
#define AON_PWR_SEQ_LPMCU_SLEEP_1_CTRL_BLE_SLEEP_EN_Pos 6                                              /**< (AON_PWR_SEQ_LPMCU_SLEEP_1_CTRL) Enables the SLEEP request 1 to put PD4 domain in sleep (BLE Core) and PD5 (BLE memories) in sleep or retention Position */
#define AON_PWR_SEQ_LPMCU_SLEEP_1_CTRL_BLE_SLEEP_EN_Msk (0x1u << AON_PWR_SEQ_LPMCU_SLEEP_1_CTRL_BLE_SLEEP_EN_Pos)  /**< (AON_PWR_SEQ_LPMCU_SLEEP_1_CTRL) Enables the SLEEP request 1 to put PD4 domain in sleep (BLE Core) and PD5 (BLE memories) in sleep or retention Mask */
#define AON_PWR_SEQ_LPMCU_SLEEP_1_CTRL_BLE_SLEEP_EN AON_PWR_SEQ_LPMCU_SLEEP_1_CTRL_BLE_SLEEP_EN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use AON_PWR_SEQ_LPMCU_SLEEP_1_CTRL_BLE_SLEEP_EN_Msk instead */
#define AON_PWR_SEQ_LPMCU_SLEEP_1_CTRL_PD6_SLEEP_EN_Pos 8                                              /**< (AON_PWR_SEQ_LPMCU_SLEEP_1_CTRL) Enables the SLEEP request 1 to put PD6 domain in sleep (BLE Sleep Timer) Position */
#define AON_PWR_SEQ_LPMCU_SLEEP_1_CTRL_PD6_SLEEP_EN_Msk (0x1u << AON_PWR_SEQ_LPMCU_SLEEP_1_CTRL_PD6_SLEEP_EN_Pos)  /**< (AON_PWR_SEQ_LPMCU_SLEEP_1_CTRL) Enables the SLEEP request 1 to put PD6 domain in sleep (BLE Sleep Timer) Mask */
#define AON_PWR_SEQ_LPMCU_SLEEP_1_CTRL_PD6_SLEEP_EN AON_PWR_SEQ_LPMCU_SLEEP_1_CTRL_PD6_SLEEP_EN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use AON_PWR_SEQ_LPMCU_SLEEP_1_CTRL_PD6_SLEEP_EN_Msk instead */
#define AON_PWR_SEQ_LPMCU_SLEEP_1_CTRL_PD7_SLEEP_EN_Pos 9                                              /**< (AON_PWR_SEQ_LPMCU_SLEEP_1_CTRL) Enables the SLEEP request 1 to put PD7 domain in sleep (EFUSE) Position */
#define AON_PWR_SEQ_LPMCU_SLEEP_1_CTRL_PD7_SLEEP_EN_Msk (0x1u << AON_PWR_SEQ_LPMCU_SLEEP_1_CTRL_PD7_SLEEP_EN_Pos)  /**< (AON_PWR_SEQ_LPMCU_SLEEP_1_CTRL) Enables the SLEEP request 1 to put PD7 domain in sleep (EFUSE) Mask */
#define AON_PWR_SEQ_LPMCU_SLEEP_1_CTRL_PD7_SLEEP_EN AON_PWR_SEQ_LPMCU_SLEEP_1_CTRL_PD7_SLEEP_EN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use AON_PWR_SEQ_LPMCU_SLEEP_1_CTRL_PD7_SLEEP_EN_Msk instead */
#define AON_PWR_SEQ_LPMCU_SLEEP_1_CTRL_PD2A_RETENTION_EN_Pos 16                                             /**< (AON_PWR_SEQ_LPMCU_SLEEP_1_CTRL) If 1, then PD2A will be put in retention mode when instructed to go to sleep (First ARM Memory 16K) Position */
#define AON_PWR_SEQ_LPMCU_SLEEP_1_CTRL_PD2A_RETENTION_EN_Msk (0x1u << AON_PWR_SEQ_LPMCU_SLEEP_1_CTRL_PD2A_RETENTION_EN_Pos)  /**< (AON_PWR_SEQ_LPMCU_SLEEP_1_CTRL) If 1, then PD2A will be put in retention mode when instructed to go to sleep (First ARM Memory 16K) Mask */
#define AON_PWR_SEQ_LPMCU_SLEEP_1_CTRL_PD2A_RETENTION_EN AON_PWR_SEQ_LPMCU_SLEEP_1_CTRL_PD2A_RETENTION_EN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use AON_PWR_SEQ_LPMCU_SLEEP_1_CTRL_PD2A_RETENTION_EN_Msk instead */
#define AON_PWR_SEQ_LPMCU_SLEEP_1_CTRL_PD2B_RETENTION_EN_Pos 17                                             /**< (AON_PWR_SEQ_LPMCU_SLEEP_1_CTRL) If 1, then PD2B will be put in retention mode when instructed to go to sleep (Second ARM Memory 16K) Position */
#define AON_PWR_SEQ_LPMCU_SLEEP_1_CTRL_PD2B_RETENTION_EN_Msk (0x1u << AON_PWR_SEQ_LPMCU_SLEEP_1_CTRL_PD2B_RETENTION_EN_Pos)  /**< (AON_PWR_SEQ_LPMCU_SLEEP_1_CTRL) If 1, then PD2B will be put in retention mode when instructed to go to sleep (Second ARM Memory 16K) Mask */
#define AON_PWR_SEQ_LPMCU_SLEEP_1_CTRL_PD2B_RETENTION_EN AON_PWR_SEQ_LPMCU_SLEEP_1_CTRL_PD2B_RETENTION_EN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use AON_PWR_SEQ_LPMCU_SLEEP_1_CTRL_PD2B_RETENTION_EN_Msk instead */
#define AON_PWR_SEQ_LPMCU_SLEEP_1_CTRL_PD3_RETENTION_EN_Pos 18                                             /**< (AON_PWR_SEQ_LPMCU_SLEEP_1_CTRL) If 1, then PD3 will be put in retention mode when instructed to go to sleep (Third, Fourth and Fifth ARM Memories 3x32K = 96K) Position */
#define AON_PWR_SEQ_LPMCU_SLEEP_1_CTRL_PD3_RETENTION_EN_Msk (0x1u << AON_PWR_SEQ_LPMCU_SLEEP_1_CTRL_PD3_RETENTION_EN_Pos)  /**< (AON_PWR_SEQ_LPMCU_SLEEP_1_CTRL) If 1, then PD3 will be put in retention mode when instructed to go to sleep (Third, Fourth and Fifth ARM Memories 3x32K = 96K) Mask */
#define AON_PWR_SEQ_LPMCU_SLEEP_1_CTRL_PD3_RETENTION_EN AON_PWR_SEQ_LPMCU_SLEEP_1_CTRL_PD3_RETENTION_EN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use AON_PWR_SEQ_LPMCU_SLEEP_1_CTRL_PD3_RETENTION_EN_Msk instead */
#define AON_PWR_SEQ_LPMCU_SLEEP_1_CTRL_PD5_RETENTION_EN_Pos 21                                             /**< (AON_PWR_SEQ_LPMCU_SLEEP_1_CTRL) If 1, then PD5 will be put in retention mode when instructed to go to sleep (BLE Retention Memory) Position */
#define AON_PWR_SEQ_LPMCU_SLEEP_1_CTRL_PD5_RETENTION_EN_Msk (0x1u << AON_PWR_SEQ_LPMCU_SLEEP_1_CTRL_PD5_RETENTION_EN_Pos)  /**< (AON_PWR_SEQ_LPMCU_SLEEP_1_CTRL) If 1, then PD5 will be put in retention mode when instructed to go to sleep (BLE Retention Memory) Mask */
#define AON_PWR_SEQ_LPMCU_SLEEP_1_CTRL_PD5_RETENTION_EN AON_PWR_SEQ_LPMCU_SLEEP_1_CTRL_PD5_RETENTION_EN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use AON_PWR_SEQ_LPMCU_SLEEP_1_CTRL_PD5_RETENTION_EN_Msk instead */
#define AON_PWR_SEQ_LPMCU_SLEEP_1_CTRL_PD8_RETENTION_EN_Pos 22                                             /**< (AON_PWR_SEQ_LPMCU_SLEEP_1_CTRL) If 1, then PD8 will be put in retention mode when instructed to go to sleep (BLE LP Memory) Position */
#define AON_PWR_SEQ_LPMCU_SLEEP_1_CTRL_PD8_RETENTION_EN_Msk (0x1u << AON_PWR_SEQ_LPMCU_SLEEP_1_CTRL_PD8_RETENTION_EN_Pos)  /**< (AON_PWR_SEQ_LPMCU_SLEEP_1_CTRL) If 1, then PD8 will be put in retention mode when instructed to go to sleep (BLE LP Memory) Mask */
#define AON_PWR_SEQ_LPMCU_SLEEP_1_CTRL_PD8_RETENTION_EN AON_PWR_SEQ_LPMCU_SLEEP_1_CTRL_PD8_RETENTION_EN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use AON_PWR_SEQ_LPMCU_SLEEP_1_CTRL_PD8_RETENTION_EN_Msk instead */
#define AON_PWR_SEQ_LPMCU_SLEEP_1_CTRL_MASK 0x670341u                                      /**< \deprecated (AON_PWR_SEQ_LPMCU_SLEEP_1_CTRL) Register MASK  (Use AON_PWR_SEQ_LPMCU_SLEEP_1_CTRL_Msk instead)  */
#define AON_PWR_SEQ_LPMCU_SLEEP_1_CTRL_Msk  0x670341u                                      /**< (AON_PWR_SEQ_LPMCU_SLEEP_1_CTRL) Register Mask  */

/* -------- AON_PWR_SEQ_OFF_DELAY_0_CTRL : (AON_PWR_SEQ Offset: 0x40) (R/W 32) Power OFF Delays -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t CLOCK_EN_EARLY:6;          /**< bit:   0..5  Number of clock cycles before setting clock_en_early to low (clock_en is +1 of this value) */
    uint32_t :10;                       /**< bit:  6..15  Reserved */
    uint32_t ISOLATE:6;                 /**< bit: 16..21  Number of clock cycles before enabling the isolation cells */
    uint32_t :2;                        /**< bit: 22..23  Reserved */
    uint32_t RESETN:6;                  /**< bit: 24..29  Number of clock cycles before asserting RESETN */
    uint32_t :2;                        /**< bit: 30..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} AON_PWR_SEQ_OFF_DELAY_0_CTRL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define AON_PWR_SEQ_OFF_DELAY_0_CTRL_OFFSET 0x40                                          /**<  (AON_PWR_SEQ_OFF_DELAY_0_CTRL) Power OFF Delays  Offset */
#define AON_PWR_SEQ_OFF_DELAY_0_CTRL_RESETVALUE 0x4030001u                                    /**<  (AON_PWR_SEQ_OFF_DELAY_0_CTRL) Power OFF Delays  Reset Value */

#define AON_PWR_SEQ_OFF_DELAY_0_CTRL_CLOCK_EN_EARLY_Pos 0                                              /**< (AON_PWR_SEQ_OFF_DELAY_0_CTRL) Number of clock cycles before setting clock_en_early to low (clock_en is +1 of this value) Position */
#define AON_PWR_SEQ_OFF_DELAY_0_CTRL_CLOCK_EN_EARLY_Msk (0x3Fu << AON_PWR_SEQ_OFF_DELAY_0_CTRL_CLOCK_EN_EARLY_Pos)  /**< (AON_PWR_SEQ_OFF_DELAY_0_CTRL) Number of clock cycles before setting clock_en_early to low (clock_en is +1 of this value) Mask */
#define AON_PWR_SEQ_OFF_DELAY_0_CTRL_CLOCK_EN_EARLY(value) (AON_PWR_SEQ_OFF_DELAY_0_CTRL_CLOCK_EN_EARLY_Msk & ((value) << AON_PWR_SEQ_OFF_DELAY_0_CTRL_CLOCK_EN_EARLY_Pos))
#define AON_PWR_SEQ_OFF_DELAY_0_CTRL_ISOLATE_Pos 16                                             /**< (AON_PWR_SEQ_OFF_DELAY_0_CTRL) Number of clock cycles before enabling the isolation cells Position */
#define AON_PWR_SEQ_OFF_DELAY_0_CTRL_ISOLATE_Msk (0x3Fu << AON_PWR_SEQ_OFF_DELAY_0_CTRL_ISOLATE_Pos)  /**< (AON_PWR_SEQ_OFF_DELAY_0_CTRL) Number of clock cycles before enabling the isolation cells Mask */
#define AON_PWR_SEQ_OFF_DELAY_0_CTRL_ISOLATE(value) (AON_PWR_SEQ_OFF_DELAY_0_CTRL_ISOLATE_Msk & ((value) << AON_PWR_SEQ_OFF_DELAY_0_CTRL_ISOLATE_Pos))
#define AON_PWR_SEQ_OFF_DELAY_0_CTRL_RESETN_Pos 24                                             /**< (AON_PWR_SEQ_OFF_DELAY_0_CTRL) Number of clock cycles before asserting RESETN Position */
#define AON_PWR_SEQ_OFF_DELAY_0_CTRL_RESETN_Msk (0x3Fu << AON_PWR_SEQ_OFF_DELAY_0_CTRL_RESETN_Pos)  /**< (AON_PWR_SEQ_OFF_DELAY_0_CTRL) Number of clock cycles before asserting RESETN Mask */
#define AON_PWR_SEQ_OFF_DELAY_0_CTRL_RESETN(value) (AON_PWR_SEQ_OFF_DELAY_0_CTRL_RESETN_Msk & ((value) << AON_PWR_SEQ_OFF_DELAY_0_CTRL_RESETN_Pos))
#define AON_PWR_SEQ_OFF_DELAY_0_CTRL_MASK   0x3F3F003Fu                                    /**< \deprecated (AON_PWR_SEQ_OFF_DELAY_0_CTRL) Register MASK  (Use AON_PWR_SEQ_OFF_DELAY_0_CTRL_Msk instead)  */
#define AON_PWR_SEQ_OFF_DELAY_0_CTRL_Msk    0x3F3F003Fu                                    /**< (AON_PWR_SEQ_OFF_DELAY_0_CTRL) Register Mask  */

