remotemcu/remcu-chip-sdks/SAM/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/aon_pwr_seq.h
/* -------- AON_PWR_SEQ_OFF_DELAY_1_CTRL : (AON_PWR_SEQ Offset: 0x44) (R/W 32) Power OFF Delays -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t BTRIM:6;                   /**< bit:   0..5  Number of clock cycles before applying BTRIM mux select */
    uint32_t :2;                        /**< bit:   6..7  Reserved */
    uint32_t STDBY_N:6;                 /**< bit:  8..13  Number of clock cycles before applying STDBY_N */
    uint32_t :2;                        /**< bit: 14..15  Reserved */
    uint32_t POWER_VDD:6;               /**< bit: 16..21  Number of clock cycles before cutting off power (VDD and standard cells) */
    uint32_t :2;                        /**< bit: 22..23  Reserved */
    uint32_t POWER_VDM:6;               /**< bit: 24..29  Number of clock cycles before cutting off or lowering power (VDM) */
    uint32_t :2;                        /**< bit: 30..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} AON_PWR_SEQ_OFF_DELAY_1_CTRL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define AON_PWR_SEQ_OFF_DELAY_1_CTRL_OFFSET 0x44                                          /**<  (AON_PWR_SEQ_OFF_DELAY_1_CTRL) Power OFF Delays  Offset */
#define AON_PWR_SEQ_OFF_DELAY_1_CTRL_RESETVALUE 0x8070605u                                    /**<  (AON_PWR_SEQ_OFF_DELAY_1_CTRL) Power OFF Delays  Reset Value */

#define AON_PWR_SEQ_OFF_DELAY_1_CTRL_BTRIM_Pos 0                                              /**< (AON_PWR_SEQ_OFF_DELAY_1_CTRL) Number of clock cycles before applying BTRIM mux select Position */
#define AON_PWR_SEQ_OFF_DELAY_1_CTRL_BTRIM_Msk (0x3Fu << AON_PWR_SEQ_OFF_DELAY_1_CTRL_BTRIM_Pos)  /**< (AON_PWR_SEQ_OFF_DELAY_1_CTRL) Number of clock cycles before applying BTRIM mux select Mask */
#define AON_PWR_SEQ_OFF_DELAY_1_CTRL_BTRIM(value) (AON_PWR_SEQ_OFF_DELAY_1_CTRL_BTRIM_Msk & ((value) << AON_PWR_SEQ_OFF_DELAY_1_CTRL_BTRIM_Pos))
#define AON_PWR_SEQ_OFF_DELAY_1_CTRL_STDBY_N_Pos 8                                              /**< (AON_PWR_SEQ_OFF_DELAY_1_CTRL) Number of clock cycles before applying STDBY_N Position */
#define AON_PWR_SEQ_OFF_DELAY_1_CTRL_STDBY_N_Msk (0x3Fu << AON_PWR_SEQ_OFF_DELAY_1_CTRL_STDBY_N_Pos)  /**< (AON_PWR_SEQ_OFF_DELAY_1_CTRL) Number of clock cycles before applying STDBY_N Mask */
#define AON_PWR_SEQ_OFF_DELAY_1_CTRL_STDBY_N(value) (AON_PWR_SEQ_OFF_DELAY_1_CTRL_STDBY_N_Msk & ((value) << AON_PWR_SEQ_OFF_DELAY_1_CTRL_STDBY_N_Pos))
#define AON_PWR_SEQ_OFF_DELAY_1_CTRL_POWER_VDD_Pos 16                                             /**< (AON_PWR_SEQ_OFF_DELAY_1_CTRL) Number of clock cycles before cutting off power (VDD and standard cells) Position */
#define AON_PWR_SEQ_OFF_DELAY_1_CTRL_POWER_VDD_Msk (0x3Fu << AON_PWR_SEQ_OFF_DELAY_1_CTRL_POWER_VDD_Pos)  /**< (AON_PWR_SEQ_OFF_DELAY_1_CTRL) Number of clock cycles before cutting off power (VDD and standard cells) Mask */
#define AON_PWR_SEQ_OFF_DELAY_1_CTRL_POWER_VDD(value) (AON_PWR_SEQ_OFF_DELAY_1_CTRL_POWER_VDD_Msk & ((value) << AON_PWR_SEQ_OFF_DELAY_1_CTRL_POWER_VDD_Pos))
#define AON_PWR_SEQ_OFF_DELAY_1_CTRL_POWER_VDM_Pos 24                                             /**< (AON_PWR_SEQ_OFF_DELAY_1_CTRL) Number of clock cycles before cutting off or lowering power (VDM) Position */
#define AON_PWR_SEQ_OFF_DELAY_1_CTRL_POWER_VDM_Msk (0x3Fu << AON_PWR_SEQ_OFF_DELAY_1_CTRL_POWER_VDM_Pos)  /**< (AON_PWR_SEQ_OFF_DELAY_1_CTRL) Number of clock cycles before cutting off or lowering power (VDM) Mask */
#define AON_PWR_SEQ_OFF_DELAY_1_CTRL_POWER_VDM(value) (AON_PWR_SEQ_OFF_DELAY_1_CTRL_POWER_VDM_Msk & ((value) << AON_PWR_SEQ_OFF_DELAY_1_CTRL_POWER_VDM_Pos))
#define AON_PWR_SEQ_OFF_DELAY_1_CTRL_MASK   0x3F3F3F3Fu                                    /**< \deprecated (AON_PWR_SEQ_OFF_DELAY_1_CTRL) Register MASK  (Use AON_PWR_SEQ_OFF_DELAY_1_CTRL_Msk instead)  */
#define AON_PWR_SEQ_OFF_DELAY_1_CTRL_Msk    0x3F3F3F3Fu                                    /**< (AON_PWR_SEQ_OFF_DELAY_1_CTRL) Register Mask  */

/* -------- AON_PWR_SEQ_ON_DELAY_0_CTRL : (AON_PWR_SEQ Offset: 0x48) (R/W 16) Power ON Delays -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint16_t CLOCK_EN_EARLY_ARM:6;      /**< bit:   0..5  Number of clock cycles before setting clock_en_early to high for ARM domain clock_en is +1 of this value isolate is -2 of this value resetn is -1 of this value  */
    uint16_t :2;                        /**< bit:   6..7  Reserved */
    uint16_t CLOCK_EN_EARLY_BLE:6;      /**< bit:  8..13  Number of clock cycles before setting clock_en_early to high for BLE domain clock_en is +1 of this value isolate is -2 of this value resetn is -1 of this value  */
    uint16_t :2;                        /**< bit: 14..15  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint16_t reg;                         /**< Type used for register access */
} AON_PWR_SEQ_ON_DELAY_0_CTRL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define AON_PWR_SEQ_ON_DELAY_0_CTRL_OFFSET  0x48                                          /**<  (AON_PWR_SEQ_ON_DELAY_0_CTRL) Power ON Delays  Offset */
#define AON_PWR_SEQ_ON_DELAY_0_CTRL_RESETVALUE 0x2727u                                       /**<  (AON_PWR_SEQ_ON_DELAY_0_CTRL) Power ON Delays  Reset Value */

#define AON_PWR_SEQ_ON_DELAY_0_CTRL_CLOCK_EN_EARLY_ARM_Pos 0                                              /**< (AON_PWR_SEQ_ON_DELAY_0_CTRL) Number of clock cycles before setting clock_en_early to high for ARM domain clock_en is +1 of this value isolate is -2 of this value resetn is -1 of this value  Position */
#define AON_PWR_SEQ_ON_DELAY_0_CTRL_CLOCK_EN_EARLY_ARM_Msk (0x3Fu << AON_PWR_SEQ_ON_DELAY_0_CTRL_CLOCK_EN_EARLY_ARM_Pos)  /**< (AON_PWR_SEQ_ON_DELAY_0_CTRL) Number of clock cycles before setting clock_en_early to high for ARM domain clock_en is +1 of this value isolate is -2 of this value resetn is -1 of this value  Mask */
#define AON_PWR_SEQ_ON_DELAY_0_CTRL_CLOCK_EN_EARLY_ARM(value) (AON_PWR_SEQ_ON_DELAY_0_CTRL_CLOCK_EN_EARLY_ARM_Msk & ((value) << AON_PWR_SEQ_ON_DELAY_0_CTRL_CLOCK_EN_EARLY_ARM_Pos))
#define AON_PWR_SEQ_ON_DELAY_0_CTRL_CLOCK_EN_EARLY_BLE_Pos 8                                              /**< (AON_PWR_SEQ_ON_DELAY_0_CTRL) Number of clock cycles before setting clock_en_early to high for BLE domain clock_en is +1 of this value isolate is -2 of this value resetn is -1 of this value  Position */
#define AON_PWR_SEQ_ON_DELAY_0_CTRL_CLOCK_EN_EARLY_BLE_Msk (0x3Fu << AON_PWR_SEQ_ON_DELAY_0_CTRL_CLOCK_EN_EARLY_BLE_Pos)  /**< (AON_PWR_SEQ_ON_DELAY_0_CTRL) Number of clock cycles before setting clock_en_early to high for BLE domain clock_en is +1 of this value isolate is -2 of this value resetn is -1 of this value  Mask */
#define AON_PWR_SEQ_ON_DELAY_0_CTRL_CLOCK_EN_EARLY_BLE(value) (AON_PWR_SEQ_ON_DELAY_0_CTRL_CLOCK_EN_EARLY_BLE_Msk & ((value) << AON_PWR_SEQ_ON_DELAY_0_CTRL_CLOCK_EN_EARLY_BLE_Pos))
#define AON_PWR_SEQ_ON_DELAY_0_CTRL_MASK    0x3F3Fu                                        /**< \deprecated (AON_PWR_SEQ_ON_DELAY_0_CTRL) Register MASK  (Use AON_PWR_SEQ_ON_DELAY_0_CTRL_Msk instead)  */
#define AON_PWR_SEQ_ON_DELAY_0_CTRL_Msk     0x3F3Fu                                        /**< (AON_PWR_SEQ_ON_DELAY_0_CTRL) Register Mask  */

