remotemcu/remcu-chip-sdks/SAM/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/aon_pwr_seq.h
/* -------- AON_PWR_SEQ_ON_DELAY_1_CTRL : (AON_PWR_SEQ Offset: 0x4c) (R/W 32) Power ON Delays -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t BTRIM:6;                   /**< bit:   0..5  Number of clock cycles before removing BTRIM mux select */
    uint32_t :2;                        /**< bit:   6..7  Reserved */
    uint32_t STDBY_N:6;                 /**< bit:  8..13  Number of clock cycles before de-asserting the STDBY_N */
    uint32_t :2;                        /**< bit: 14..15  Reserved */
    uint32_t POWER_VDD:6;               /**< bit: 16..21  Number of clock cycles before applying VDD power */
    uint32_t :2;                        /**< bit: 22..23  Reserved */
    uint32_t POWER_VDM:6;               /**< bit: 24..29  Number of clock cycles before applying VDM power */
    uint32_t :2;                        /**< bit: 30..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} AON_PWR_SEQ_ON_DELAY_1_CTRL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define AON_PWR_SEQ_ON_DELAY_1_CTRL_OFFSET  0x4C                                          /**<  (AON_PWR_SEQ_ON_DELAY_1_CTRL) Power ON Delays  Offset */
#define AON_PWR_SEQ_ON_DELAY_1_CTRL_RESETVALUE 0x1020304u                                    /**<  (AON_PWR_SEQ_ON_DELAY_1_CTRL) Power ON Delays  Reset Value */

#define AON_PWR_SEQ_ON_DELAY_1_CTRL_BTRIM_Pos 0                                              /**< (AON_PWR_SEQ_ON_DELAY_1_CTRL) Number of clock cycles before removing BTRIM mux select Position */
#define AON_PWR_SEQ_ON_DELAY_1_CTRL_BTRIM_Msk (0x3Fu << AON_PWR_SEQ_ON_DELAY_1_CTRL_BTRIM_Pos)  /**< (AON_PWR_SEQ_ON_DELAY_1_CTRL) Number of clock cycles before removing BTRIM mux select Mask */
#define AON_PWR_SEQ_ON_DELAY_1_CTRL_BTRIM(value) (AON_PWR_SEQ_ON_DELAY_1_CTRL_BTRIM_Msk & ((value) << AON_PWR_SEQ_ON_DELAY_1_CTRL_BTRIM_Pos))
#define AON_PWR_SEQ_ON_DELAY_1_CTRL_STDBY_N_Pos 8                                              /**< (AON_PWR_SEQ_ON_DELAY_1_CTRL) Number of clock cycles before de-asserting the STDBY_N Position */
#define AON_PWR_SEQ_ON_DELAY_1_CTRL_STDBY_N_Msk (0x3Fu << AON_PWR_SEQ_ON_DELAY_1_CTRL_STDBY_N_Pos)  /**< (AON_PWR_SEQ_ON_DELAY_1_CTRL) Number of clock cycles before de-asserting the STDBY_N Mask */
#define AON_PWR_SEQ_ON_DELAY_1_CTRL_STDBY_N(value) (AON_PWR_SEQ_ON_DELAY_1_CTRL_STDBY_N_Msk & ((value) << AON_PWR_SEQ_ON_DELAY_1_CTRL_STDBY_N_Pos))
#define AON_PWR_SEQ_ON_DELAY_1_CTRL_POWER_VDD_Pos 16                                             /**< (AON_PWR_SEQ_ON_DELAY_1_CTRL) Number of clock cycles before applying VDD power Position */
#define AON_PWR_SEQ_ON_DELAY_1_CTRL_POWER_VDD_Msk (0x3Fu << AON_PWR_SEQ_ON_DELAY_1_CTRL_POWER_VDD_Pos)  /**< (AON_PWR_SEQ_ON_DELAY_1_CTRL) Number of clock cycles before applying VDD power Mask */
#define AON_PWR_SEQ_ON_DELAY_1_CTRL_POWER_VDD(value) (AON_PWR_SEQ_ON_DELAY_1_CTRL_POWER_VDD_Msk & ((value) << AON_PWR_SEQ_ON_DELAY_1_CTRL_POWER_VDD_Pos))
#define AON_PWR_SEQ_ON_DELAY_1_CTRL_POWER_VDM_Pos 24                                             /**< (AON_PWR_SEQ_ON_DELAY_1_CTRL) Number of clock cycles before applying VDM power Position */
#define AON_PWR_SEQ_ON_DELAY_1_CTRL_POWER_VDM_Msk (0x3Fu << AON_PWR_SEQ_ON_DELAY_1_CTRL_POWER_VDM_Pos)  /**< (AON_PWR_SEQ_ON_DELAY_1_CTRL) Number of clock cycles before applying VDM power Mask */
#define AON_PWR_SEQ_ON_DELAY_1_CTRL_POWER_VDM(value) (AON_PWR_SEQ_ON_DELAY_1_CTRL_POWER_VDM_Msk & ((value) << AON_PWR_SEQ_ON_DELAY_1_CTRL_POWER_VDM_Pos))
#define AON_PWR_SEQ_ON_DELAY_1_CTRL_MASK    0x3F3F3F3Fu                                    /**< \deprecated (AON_PWR_SEQ_ON_DELAY_1_CTRL) Register MASK  (Use AON_PWR_SEQ_ON_DELAY_1_CTRL_Msk instead)  */
#define AON_PWR_SEQ_ON_DELAY_1_CTRL_Msk     0x3F3F3F3Fu                                    /**< (AON_PWR_SEQ_ON_DELAY_1_CTRL) Register Mask  */

/* -------- AON_PWR_SEQ_VDD_DCDC_EN_DELAY_CTRL : (AON_PWR_SEQ Offset: 0x50) (R/W 16) VDD_DCDC_EN Delay Control -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint16_t OFF:6;                     /**< bit:   0..5  Number of clock cycles before disabling the DCDC */
    uint16_t :2;                        /**< bit:   6..7  Reserved */
    uint16_t ON:6;                      /**< bit:  8..13  Number of clock cycles before turning on the DCDC */
    uint16_t :2;                        /**< bit: 14..15  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint16_t reg;                         /**< Type used for register access */
} AON_PWR_SEQ_VDD_DCDC_EN_DELAY_CTRL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define AON_PWR_SEQ_VDD_DCDC_EN_DELAY_CTRL_OFFSET 0x50                                          /**<  (AON_PWR_SEQ_VDD_DCDC_EN_DELAY_CTRL) VDD_DCDC_EN Delay Control  Offset */
#define AON_PWR_SEQ_VDD_DCDC_EN_DELAY_CTRL_RESETVALUE 0x2106u                                       /**<  (AON_PWR_SEQ_VDD_DCDC_EN_DELAY_CTRL) VDD_DCDC_EN Delay Control  Reset Value */

#define AON_PWR_SEQ_VDD_DCDC_EN_DELAY_CTRL_OFF_Pos 0                                              /**< (AON_PWR_SEQ_VDD_DCDC_EN_DELAY_CTRL) Number of clock cycles before disabling the DCDC Position */
#define AON_PWR_SEQ_VDD_DCDC_EN_DELAY_CTRL_OFF_Msk (0x3Fu << AON_PWR_SEQ_VDD_DCDC_EN_DELAY_CTRL_OFF_Pos)  /**< (AON_PWR_SEQ_VDD_DCDC_EN_DELAY_CTRL) Number of clock cycles before disabling the DCDC Mask */
#define AON_PWR_SEQ_VDD_DCDC_EN_DELAY_CTRL_OFF(value) (AON_PWR_SEQ_VDD_DCDC_EN_DELAY_CTRL_OFF_Msk & ((value) << AON_PWR_SEQ_VDD_DCDC_EN_DELAY_CTRL_OFF_Pos))
#define AON_PWR_SEQ_VDD_DCDC_EN_DELAY_CTRL_ON_Pos 8                                              /**< (AON_PWR_SEQ_VDD_DCDC_EN_DELAY_CTRL) Number of clock cycles before turning on the DCDC Position */
#define AON_PWR_SEQ_VDD_DCDC_EN_DELAY_CTRL_ON_Msk (0x3Fu << AON_PWR_SEQ_VDD_DCDC_EN_DELAY_CTRL_ON_Pos)  /**< (AON_PWR_SEQ_VDD_DCDC_EN_DELAY_CTRL) Number of clock cycles before turning on the DCDC Mask */
#define AON_PWR_SEQ_VDD_DCDC_EN_DELAY_CTRL_ON(value) (AON_PWR_SEQ_VDD_DCDC_EN_DELAY_CTRL_ON_Msk & ((value) << AON_PWR_SEQ_VDD_DCDC_EN_DELAY_CTRL_ON_Pos))
#define AON_PWR_SEQ_VDD_DCDC_EN_DELAY_CTRL_MASK 0x3F3Fu                                        /**< \deprecated (AON_PWR_SEQ_VDD_DCDC_EN_DELAY_CTRL) Register MASK  (Use AON_PWR_SEQ_VDD_DCDC_EN_DELAY_CTRL_Msk instead)  */
#define AON_PWR_SEQ_VDD_DCDC_EN_DELAY_CTRL_Msk 0x3F3Fu                                        /**< (AON_PWR_SEQ_VDD_DCDC_EN_DELAY_CTRL) Register Mask  */

