remotemcu/remcu-chip-sdks/SAM/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/aon_pwr_seq.h
/* -------- AON_PWR_SEQ_MISC_BYPASS_0_CTRL : (AON_PWR_SEQ Offset: 0x218) (R/W 16) Bypass control for misc signals -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint16_t :2;                        /**< bit:   0..1  Reserved */
    uint16_t PD0_LOW_VOLTAGE_EN_VAL:1;  /**< bit:      2  Bypass value for pd0_low_voltage_en      */
    uint16_t PD0_LOW_VOLTAGE_EN_EN:1;   /**< bit:      3  Bypass enable for pd0_low_voltage_en     */
    uint16_t ENABLE_CLOCK_GATE:1;       /**< bit:      4  If set, allows the AON PS to gate its own clock while waiting for an event to enable it again */
    uint16_t :1;                        /**< bit:      5  Reserved */
    uint16_t VDD_DCDC_EN_VAL:1;         /**< bit:      6  Bypass value for vdd_dcdc_en             */
    uint16_t VDD_DCDC_EN_EN:1;          /**< bit:      7  Bypass enable for vdd_dcdc_en            */
    uint16_t FORCE_ON_BLE_CORE:1;       /**< bit:      8  If set, this will keep the power enabled for the BLE Core (enables the DCDC operation) */
    uint16_t FORCE_ON_BLE_MEMORIES:1;   /**< bit:      9  If set, this will keep the power enabled for the BLE memories (enables the DCDC operation) */
    uint16_t :6;                        /**< bit: 10..15  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint16_t reg;                         /**< Type used for register access */
} AON_PWR_SEQ_MISC_BYPASS_0_CTRL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define AON_PWR_SEQ_MISC_BYPASS_0_CTRL_OFFSET 0x218                                         /**<  (AON_PWR_SEQ_MISC_BYPASS_0_CTRL) Bypass control for misc signals  Offset */
#define AON_PWR_SEQ_MISC_BYPASS_0_CTRL_RESETVALUE 0x88u                                         /**<  (AON_PWR_SEQ_MISC_BYPASS_0_CTRL) Bypass control for misc signals  Reset Value */

#define AON_PWR_SEQ_MISC_BYPASS_0_CTRL_PD0_LOW_VOLTAGE_EN_VAL_Pos 2                                              /**< (AON_PWR_SEQ_MISC_BYPASS_0_CTRL) Bypass value for pd0_low_voltage_en Position */
#define AON_PWR_SEQ_MISC_BYPASS_0_CTRL_PD0_LOW_VOLTAGE_EN_VAL_Msk (0x1u << AON_PWR_SEQ_MISC_BYPASS_0_CTRL_PD0_LOW_VOLTAGE_EN_VAL_Pos)  /**< (AON_PWR_SEQ_MISC_BYPASS_0_CTRL) Bypass value for pd0_low_voltage_en Mask */
#define AON_PWR_SEQ_MISC_BYPASS_0_CTRL_PD0_LOW_VOLTAGE_EN_VAL AON_PWR_SEQ_MISC_BYPASS_0_CTRL_PD0_LOW_VOLTAGE_EN_VAL_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use AON_PWR_SEQ_MISC_BYPASS_0_CTRL_PD0_LOW_VOLTAGE_EN_VAL_Msk instead */
#define AON_PWR_SEQ_MISC_BYPASS_0_CTRL_PD0_LOW_VOLTAGE_EN_EN_Pos 3                                              /**< (AON_PWR_SEQ_MISC_BYPASS_0_CTRL) Bypass enable for pd0_low_voltage_en Position */
#define AON_PWR_SEQ_MISC_BYPASS_0_CTRL_PD0_LOW_VOLTAGE_EN_EN_Msk (0x1u << AON_PWR_SEQ_MISC_BYPASS_0_CTRL_PD0_LOW_VOLTAGE_EN_EN_Pos)  /**< (AON_PWR_SEQ_MISC_BYPASS_0_CTRL) Bypass enable for pd0_low_voltage_en Mask */
#define AON_PWR_SEQ_MISC_BYPASS_0_CTRL_PD0_LOW_VOLTAGE_EN_EN AON_PWR_SEQ_MISC_BYPASS_0_CTRL_PD0_LOW_VOLTAGE_EN_EN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use AON_PWR_SEQ_MISC_BYPASS_0_CTRL_PD0_LOW_VOLTAGE_EN_EN_Msk instead */
#define AON_PWR_SEQ_MISC_BYPASS_0_CTRL_ENABLE_CLOCK_GATE_Pos 4                                              /**< (AON_PWR_SEQ_MISC_BYPASS_0_CTRL) If set, allows the AON PS to gate its own clock while waiting for an event to enable it again Position */
#define AON_PWR_SEQ_MISC_BYPASS_0_CTRL_ENABLE_CLOCK_GATE_Msk (0x1u << AON_PWR_SEQ_MISC_BYPASS_0_CTRL_ENABLE_CLOCK_GATE_Pos)  /**< (AON_PWR_SEQ_MISC_BYPASS_0_CTRL) If set, allows the AON PS to gate its own clock while waiting for an event to enable it again Mask */
#define AON_PWR_SEQ_MISC_BYPASS_0_CTRL_ENABLE_CLOCK_GATE AON_PWR_SEQ_MISC_BYPASS_0_CTRL_ENABLE_CLOCK_GATE_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use AON_PWR_SEQ_MISC_BYPASS_0_CTRL_ENABLE_CLOCK_GATE_Msk instead */
#define AON_PWR_SEQ_MISC_BYPASS_0_CTRL_VDD_DCDC_EN_VAL_Pos 6                                              /**< (AON_PWR_SEQ_MISC_BYPASS_0_CTRL) Bypass value for vdd_dcdc_en Position */
#define AON_PWR_SEQ_MISC_BYPASS_0_CTRL_VDD_DCDC_EN_VAL_Msk (0x1u << AON_PWR_SEQ_MISC_BYPASS_0_CTRL_VDD_DCDC_EN_VAL_Pos)  /**< (AON_PWR_SEQ_MISC_BYPASS_0_CTRL) Bypass value for vdd_dcdc_en Mask */
#define AON_PWR_SEQ_MISC_BYPASS_0_CTRL_VDD_DCDC_EN_VAL AON_PWR_SEQ_MISC_BYPASS_0_CTRL_VDD_DCDC_EN_VAL_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use AON_PWR_SEQ_MISC_BYPASS_0_CTRL_VDD_DCDC_EN_VAL_Msk instead */
#define AON_PWR_SEQ_MISC_BYPASS_0_CTRL_VDD_DCDC_EN_EN_Pos 7                                              /**< (AON_PWR_SEQ_MISC_BYPASS_0_CTRL) Bypass enable for vdd_dcdc_en Position */
#define AON_PWR_SEQ_MISC_BYPASS_0_CTRL_VDD_DCDC_EN_EN_Msk (0x1u << AON_PWR_SEQ_MISC_BYPASS_0_CTRL_VDD_DCDC_EN_EN_Pos)  /**< (AON_PWR_SEQ_MISC_BYPASS_0_CTRL) Bypass enable for vdd_dcdc_en Mask */
#define AON_PWR_SEQ_MISC_BYPASS_0_CTRL_VDD_DCDC_EN_EN AON_PWR_SEQ_MISC_BYPASS_0_CTRL_VDD_DCDC_EN_EN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use AON_PWR_SEQ_MISC_BYPASS_0_CTRL_VDD_DCDC_EN_EN_Msk instead */
#define AON_PWR_SEQ_MISC_BYPASS_0_CTRL_FORCE_ON_BLE_CORE_Pos 8                                              /**< (AON_PWR_SEQ_MISC_BYPASS_0_CTRL) If set, this will keep the power enabled for the BLE Core (enables the DCDC operation) Position */
#define AON_PWR_SEQ_MISC_BYPASS_0_CTRL_FORCE_ON_BLE_CORE_Msk (0x1u << AON_PWR_SEQ_MISC_BYPASS_0_CTRL_FORCE_ON_BLE_CORE_Pos)  /**< (AON_PWR_SEQ_MISC_BYPASS_0_CTRL) If set, this will keep the power enabled for the BLE Core (enables the DCDC operation) Mask */
#define AON_PWR_SEQ_MISC_BYPASS_0_CTRL_FORCE_ON_BLE_CORE AON_PWR_SEQ_MISC_BYPASS_0_CTRL_FORCE_ON_BLE_CORE_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use AON_PWR_SEQ_MISC_BYPASS_0_CTRL_FORCE_ON_BLE_CORE_Msk instead */
#define AON_PWR_SEQ_MISC_BYPASS_0_CTRL_FORCE_ON_BLE_MEMORIES_Pos 9                                              /**< (AON_PWR_SEQ_MISC_BYPASS_0_CTRL) If set, this will keep the power enabled for the BLE memories (enables the DCDC operation) Position */
#define AON_PWR_SEQ_MISC_BYPASS_0_CTRL_FORCE_ON_BLE_MEMORIES_Msk (0x1u << AON_PWR_SEQ_MISC_BYPASS_0_CTRL_FORCE_ON_BLE_MEMORIES_Pos)  /**< (AON_PWR_SEQ_MISC_BYPASS_0_CTRL) If set, this will keep the power enabled for the BLE memories (enables the DCDC operation) Mask */
#define AON_PWR_SEQ_MISC_BYPASS_0_CTRL_FORCE_ON_BLE_MEMORIES AON_PWR_SEQ_MISC_BYPASS_0_CTRL_FORCE_ON_BLE_MEMORIES_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use AON_PWR_SEQ_MISC_BYPASS_0_CTRL_FORCE_ON_BLE_MEMORIES_Msk instead */
#define AON_PWR_SEQ_MISC_BYPASS_0_CTRL_MASK 0x3DCu                                         /**< \deprecated (AON_PWR_SEQ_MISC_BYPASS_0_CTRL) Register MASK  (Use AON_PWR_SEQ_MISC_BYPASS_0_CTRL_Msk instead)  */
#define AON_PWR_SEQ_MISC_BYPASS_0_CTRL_Msk  0x3DCu                                         /**< (AON_PWR_SEQ_MISC_BYPASS_0_CTRL) Register Mask  */

