remotemcu/remcu-chip-sdks/SAM/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/aon_pwr_seq.h
/* -------- AON_PWR_SEQ_RAW_WAKEUP_BITS : (AON_PWR_SEQ Offset: 0x300) (R/ 8) Raw Wakeup Bits -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  GPIO_0:1;                  /**< bit:      0  AO_GPIO_0 wakeup raw status              */
    uint8_t  GPIO_1:1;                  /**< bit:      1  AO_GPIO_1 wakeup raw status              */
    uint8_t  GPIO_2:1;                  /**< bit:      2  AO_GPIO_2 wakeup raw status              */
    uint8_t  AON_ST:1;                  /**< bit:      3  AON_ST wakeup raw status                 */
    uint8_t  LPMCU:1;                   /**< bit:      4  LPMCU wakeup raw status                  */
    uint8_t  BLE_ST:1;                  /**< bit:      5  BLE_ST wakeup raw status                 */
    uint8_t  :2;                        /**< bit:   6..7  Reserved */
  } bit;                                /**< Structure used for bit  access */
  struct {
    uint8_t  GPIO_:3;                   /**< bit:   0..2  AO_GPIO_x wakeup raw status              */
    uint8_t  :5;                        /**< bit:   3..7 Reserved */
  } vec;                                /**< Structure used for vec  access  */
  uint8_t  reg;                         /**< Type used for register access */
} AON_PWR_SEQ_RAW_WAKEUP_BITS_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define AON_PWR_SEQ_RAW_WAKEUP_BITS_OFFSET  0x300                                         /**<  (AON_PWR_SEQ_RAW_WAKEUP_BITS) Raw Wakeup Bits  Offset */
#define AON_PWR_SEQ_RAW_WAKEUP_BITS_RESETVALUE 0x00u                                         /**<  (AON_PWR_SEQ_RAW_WAKEUP_BITS) Raw Wakeup Bits  Reset Value */

#define AON_PWR_SEQ_RAW_WAKEUP_BITS_GPIO_0_Pos 0                                              /**< (AON_PWR_SEQ_RAW_WAKEUP_BITS) AO_GPIO_0 wakeup raw status Position */
#define AON_PWR_SEQ_RAW_WAKEUP_BITS_GPIO_0_Msk (0x1u << AON_PWR_SEQ_RAW_WAKEUP_BITS_GPIO_0_Pos)  /**< (AON_PWR_SEQ_RAW_WAKEUP_BITS) AO_GPIO_0 wakeup raw status Mask */
#define AON_PWR_SEQ_RAW_WAKEUP_BITS_GPIO_0  AON_PWR_SEQ_RAW_WAKEUP_BITS_GPIO_0_Msk         /**< \deprecated Old style mask definition for 1 bit bitfield. Use AON_PWR_SEQ_RAW_WAKEUP_BITS_GPIO_0_Msk instead */
#define AON_PWR_SEQ_RAW_WAKEUP_BITS_GPIO_1_Pos 1                                              /**< (AON_PWR_SEQ_RAW_WAKEUP_BITS) AO_GPIO_1 wakeup raw status Position */
#define AON_PWR_SEQ_RAW_WAKEUP_BITS_GPIO_1_Msk (0x1u << AON_PWR_SEQ_RAW_WAKEUP_BITS_GPIO_1_Pos)  /**< (AON_PWR_SEQ_RAW_WAKEUP_BITS) AO_GPIO_1 wakeup raw status Mask */
#define AON_PWR_SEQ_RAW_WAKEUP_BITS_GPIO_1  AON_PWR_SEQ_RAW_WAKEUP_BITS_GPIO_1_Msk         /**< \deprecated Old style mask definition for 1 bit bitfield. Use AON_PWR_SEQ_RAW_WAKEUP_BITS_GPIO_1_Msk instead */
#define AON_PWR_SEQ_RAW_WAKEUP_BITS_GPIO_2_Pos 2                                              /**< (AON_PWR_SEQ_RAW_WAKEUP_BITS) AO_GPIO_2 wakeup raw status Position */
#define AON_PWR_SEQ_RAW_WAKEUP_BITS_GPIO_2_Msk (0x1u << AON_PWR_SEQ_RAW_WAKEUP_BITS_GPIO_2_Pos)  /**< (AON_PWR_SEQ_RAW_WAKEUP_BITS) AO_GPIO_2 wakeup raw status Mask */
#define AON_PWR_SEQ_RAW_WAKEUP_BITS_GPIO_2  AON_PWR_SEQ_RAW_WAKEUP_BITS_GPIO_2_Msk         /**< \deprecated Old style mask definition for 1 bit bitfield. Use AON_PWR_SEQ_RAW_WAKEUP_BITS_GPIO_2_Msk instead */
#define AON_PWR_SEQ_RAW_WAKEUP_BITS_AON_ST_Pos 3                                              /**< (AON_PWR_SEQ_RAW_WAKEUP_BITS) AON_ST wakeup raw status Position */
#define AON_PWR_SEQ_RAW_WAKEUP_BITS_AON_ST_Msk (0x1u << AON_PWR_SEQ_RAW_WAKEUP_BITS_AON_ST_Pos)  /**< (AON_PWR_SEQ_RAW_WAKEUP_BITS) AON_ST wakeup raw status Mask */
#define AON_PWR_SEQ_RAW_WAKEUP_BITS_AON_ST  AON_PWR_SEQ_RAW_WAKEUP_BITS_AON_ST_Msk         /**< \deprecated Old style mask definition for 1 bit bitfield. Use AON_PWR_SEQ_RAW_WAKEUP_BITS_AON_ST_Msk instead */
#define AON_PWR_SEQ_RAW_WAKEUP_BITS_LPMCU_Pos 4                                              /**< (AON_PWR_SEQ_RAW_WAKEUP_BITS) LPMCU wakeup raw status Position */
#define AON_PWR_SEQ_RAW_WAKEUP_BITS_LPMCU_Msk (0x1u << AON_PWR_SEQ_RAW_WAKEUP_BITS_LPMCU_Pos)  /**< (AON_PWR_SEQ_RAW_WAKEUP_BITS) LPMCU wakeup raw status Mask */
#define AON_PWR_SEQ_RAW_WAKEUP_BITS_LPMCU   AON_PWR_SEQ_RAW_WAKEUP_BITS_LPMCU_Msk          /**< \deprecated Old style mask definition for 1 bit bitfield. Use AON_PWR_SEQ_RAW_WAKEUP_BITS_LPMCU_Msk instead */
#define AON_PWR_SEQ_RAW_WAKEUP_BITS_BLE_ST_Pos 5                                              /**< (AON_PWR_SEQ_RAW_WAKEUP_BITS) BLE_ST wakeup raw status Position */
#define AON_PWR_SEQ_RAW_WAKEUP_BITS_BLE_ST_Msk (0x1u << AON_PWR_SEQ_RAW_WAKEUP_BITS_BLE_ST_Pos)  /**< (AON_PWR_SEQ_RAW_WAKEUP_BITS) BLE_ST wakeup raw status Mask */
#define AON_PWR_SEQ_RAW_WAKEUP_BITS_BLE_ST  AON_PWR_SEQ_RAW_WAKEUP_BITS_BLE_ST_Msk         /**< \deprecated Old style mask definition for 1 bit bitfield. Use AON_PWR_SEQ_RAW_WAKEUP_BITS_BLE_ST_Msk instead */
#define AON_PWR_SEQ_RAW_WAKEUP_BITS_GPIO__Pos 0                                              /**< (AON_PWR_SEQ_RAW_WAKEUP_BITS Position) AO_GPIO_x wakeup raw status */
#define AON_PWR_SEQ_RAW_WAKEUP_BITS_GPIO__Msk (0x7u << AON_PWR_SEQ_RAW_WAKEUP_BITS_GPIO__Pos)  /**< (AON_PWR_SEQ_RAW_WAKEUP_BITS Mask) GPIO_ */
#define AON_PWR_SEQ_RAW_WAKEUP_BITS_GPIO_(value) (AON_PWR_SEQ_RAW_WAKEUP_BITS_GPIO__Msk & ((value) << AON_PWR_SEQ_RAW_WAKEUP_BITS_GPIO__Pos))  
#define AON_PWR_SEQ_RAW_WAKEUP_BITS_MASK    0x3Fu                                          /**< \deprecated (AON_PWR_SEQ_RAW_WAKEUP_BITS) Register MASK  (Use AON_PWR_SEQ_RAW_WAKEUP_BITS_Msk instead)  */
#define AON_PWR_SEQ_RAW_WAKEUP_BITS_Msk     0x3Fu                                          /**< (AON_PWR_SEQ_RAW_WAKEUP_BITS) Register Mask  */

/* -------- AON_PWR_SEQ_PD_WAKEUP_BITS : (AON_PWR_SEQ Offset: 0x304) (R/ 16) Individual Power Domain Wakeup Bits -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint16_t ARM:1;                     /**< bit:      0  Indicates ARM (PD1, PD2A, PD2B, PD3, PD8) currently has a wakeup active */
    uint16_t :5;                        /**< bit:   1..5  Reserved */
    uint16_t BLE:1;                     /**< bit:      6  Indicates BLE (PD4 and PD5) currently has a wakeup active */
    uint16_t :1;                        /**< bit:      7  Reserved */
    uint16_t PD6:1;                     /**< bit:      8  Indicates PD6 currently has a wakeup active */
    uint16_t PD7:1;                     /**< bit:      9  Indicates PD7 currently has a wakeup active */
    uint16_t :6;                        /**< bit: 10..15  Reserved */
  } bit;                                /**< Structure used for bit  access */
  struct {
    uint16_t :8;                        /**< bit:   0..7  Reserved */
    uint16_t PD:2;                      /**< bit:   8..9  Indicates PD7 currently has a wakeup active */
    uint16_t :6;                        /**< bit: 10..15 Reserved */
  } vec;                                /**< Structure used for vec  access  */
  uint16_t reg;                         /**< Type used for register access */
} AON_PWR_SEQ_PD_WAKEUP_BITS_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define AON_PWR_SEQ_PD_WAKEUP_BITS_OFFSET   0x304                                         /**<  (AON_PWR_SEQ_PD_WAKEUP_BITS) Individual Power Domain Wakeup Bits  Offset */
#define AON_PWR_SEQ_PD_WAKEUP_BITS_RESETVALUE 0x00u                                         /**<  (AON_PWR_SEQ_PD_WAKEUP_BITS) Individual Power Domain Wakeup Bits  Reset Value */

#define AON_PWR_SEQ_PD_WAKEUP_BITS_ARM_Pos  0                                              /**< (AON_PWR_SEQ_PD_WAKEUP_BITS) Indicates ARM (PD1, PD2A, PD2B, PD3, PD8) currently has a wakeup active Position */
#define AON_PWR_SEQ_PD_WAKEUP_BITS_ARM_Msk  (0x1u << AON_PWR_SEQ_PD_WAKEUP_BITS_ARM_Pos)   /**< (AON_PWR_SEQ_PD_WAKEUP_BITS) Indicates ARM (PD1, PD2A, PD2B, PD3, PD8) currently has a wakeup active Mask */
#define AON_PWR_SEQ_PD_WAKEUP_BITS_ARM      AON_PWR_SEQ_PD_WAKEUP_BITS_ARM_Msk             /**< \deprecated Old style mask definition for 1 bit bitfield. Use AON_PWR_SEQ_PD_WAKEUP_BITS_ARM_Msk instead */
#define AON_PWR_SEQ_PD_WAKEUP_BITS_BLE_Pos  6                                              /**< (AON_PWR_SEQ_PD_WAKEUP_BITS) Indicates BLE (PD4 and PD5) currently has a wakeup active Position */
#define AON_PWR_SEQ_PD_WAKEUP_BITS_BLE_Msk  (0x1u << AON_PWR_SEQ_PD_WAKEUP_BITS_BLE_Pos)   /**< (AON_PWR_SEQ_PD_WAKEUP_BITS) Indicates BLE (PD4 and PD5) currently has a wakeup active Mask */
#define AON_PWR_SEQ_PD_WAKEUP_BITS_BLE      AON_PWR_SEQ_PD_WAKEUP_BITS_BLE_Msk             /**< \deprecated Old style mask definition for 1 bit bitfield. Use AON_PWR_SEQ_PD_WAKEUP_BITS_BLE_Msk instead */
#define AON_PWR_SEQ_PD_WAKEUP_BITS_PD6_Pos  8                                              /**< (AON_PWR_SEQ_PD_WAKEUP_BITS) Indicates PD6 currently has a wakeup active Position */
#define AON_PWR_SEQ_PD_WAKEUP_BITS_PD6_Msk  (0x1u << AON_PWR_SEQ_PD_WAKEUP_BITS_PD6_Pos)   /**< (AON_PWR_SEQ_PD_WAKEUP_BITS) Indicates PD6 currently has a wakeup active Mask */
#define AON_PWR_SEQ_PD_WAKEUP_BITS_PD6      AON_PWR_SEQ_PD_WAKEUP_BITS_PD6_Msk             /**< \deprecated Old style mask definition for 1 bit bitfield. Use AON_PWR_SEQ_PD_WAKEUP_BITS_PD6_Msk instead */
#define AON_PWR_SEQ_PD_WAKEUP_BITS_PD7_Pos  9                                              /**< (AON_PWR_SEQ_PD_WAKEUP_BITS) Indicates PD7 currently has a wakeup active Position */
#define AON_PWR_SEQ_PD_WAKEUP_BITS_PD7_Msk  (0x1u << AON_PWR_SEQ_PD_WAKEUP_BITS_PD7_Pos)   /**< (AON_PWR_SEQ_PD_WAKEUP_BITS) Indicates PD7 currently has a wakeup active Mask */
#define AON_PWR_SEQ_PD_WAKEUP_BITS_PD7      AON_PWR_SEQ_PD_WAKEUP_BITS_PD7_Msk             /**< \deprecated Old style mask definition for 1 bit bitfield. Use AON_PWR_SEQ_PD_WAKEUP_BITS_PD7_Msk instead */
#define AON_PWR_SEQ_PD_WAKEUP_BITS_PD_Pos   8                                              /**< (AON_PWR_SEQ_PD_WAKEUP_BITS Position) Indicates PD7 currently has a wakeup active */
#define AON_PWR_SEQ_PD_WAKEUP_BITS_PD_Msk   (0x3u << AON_PWR_SEQ_PD_WAKEUP_BITS_PD_Pos)    /**< (AON_PWR_SEQ_PD_WAKEUP_BITS Mask) PD */
#define AON_PWR_SEQ_PD_WAKEUP_BITS_PD(value) (AON_PWR_SEQ_PD_WAKEUP_BITS_PD_Msk & ((value) << AON_PWR_SEQ_PD_WAKEUP_BITS_PD_Pos))  
#define AON_PWR_SEQ_PD_WAKEUP_BITS_MASK     0x341u                                         /**< \deprecated (AON_PWR_SEQ_PD_WAKEUP_BITS) Register MASK  (Use AON_PWR_SEQ_PD_WAKEUP_BITS_Msk instead)  */
#define AON_PWR_SEQ_PD_WAKEUP_BITS_Msk      0x341u                                         /**< (AON_PWR_SEQ_PD_WAKEUP_BITS) Register Mask  */

/* -------- AON_PWR_SEQ_SERVICED_REQUEST : (AON_PWR_SEQ Offset: 0x308) (R/ 16) Serviced Request Status Bits -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint16_t GPIO_WAKEUP:1;             /**< bit:      0  Indicates GPIO wakeup has been serviced  */
    uint16_t :2;                        /**< bit:   1..2  Reserved */
    uint16_t AON_ST_WAKEUP:1;           /**< bit:      3  Indicates AON_ST wakeup has been serviced */
    uint16_t LPMCU_WAKEUP:1;            /**< bit:      4  Indicates LPMCU wakeup has been serviced */
    uint16_t BLE_ST_WAKEUP:1;           /**< bit:      5  Indicates BLE_ST wakeup has been serviced */
    uint16_t :2;                        /**< bit:   6..7  Reserved */
    uint16_t SLEEP_1:1;                 /**< bit:      8  Indicates SLEEP 1 has been serviced      */
    uint16_t :7;                        /**< bit:  9..15  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint16_t reg;                         /**< Type used for register access */
} AON_PWR_SEQ_SERVICED_REQUEST_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define AON_PWR_SEQ_SERVICED_REQUEST_OFFSET 0x308                                         /**<  (AON_PWR_SEQ_SERVICED_REQUEST) Serviced Request Status Bits  Offset */
#define AON_PWR_SEQ_SERVICED_REQUEST_RESETVALUE 0x00u                                         /**<  (AON_PWR_SEQ_SERVICED_REQUEST) Serviced Request Status Bits  Reset Value */

