remotemcu/remcu-chip-sdks/SAM/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/aon_pwr_seq.h
#define AON_PWR_SEQ_SERVICED_REQUEST_GPIO_WAKEUP_Pos 0                                              /**< (AON_PWR_SEQ_SERVICED_REQUEST) Indicates GPIO wakeup has been serviced Position */
#define AON_PWR_SEQ_SERVICED_REQUEST_GPIO_WAKEUP_Msk (0x1u << AON_PWR_SEQ_SERVICED_REQUEST_GPIO_WAKEUP_Pos)  /**< (AON_PWR_SEQ_SERVICED_REQUEST) Indicates GPIO wakeup has been serviced Mask */
#define AON_PWR_SEQ_SERVICED_REQUEST_GPIO_WAKEUP AON_PWR_SEQ_SERVICED_REQUEST_GPIO_WAKEUP_Msk   /**< \deprecated Old style mask definition for 1 bit bitfield. Use AON_PWR_SEQ_SERVICED_REQUEST_GPIO_WAKEUP_Msk instead */
#define AON_PWR_SEQ_SERVICED_REQUEST_AON_ST_WAKEUP_Pos 3                                              /**< (AON_PWR_SEQ_SERVICED_REQUEST) Indicates AON_ST wakeup has been serviced Position */
#define AON_PWR_SEQ_SERVICED_REQUEST_AON_ST_WAKEUP_Msk (0x1u << AON_PWR_SEQ_SERVICED_REQUEST_AON_ST_WAKEUP_Pos)  /**< (AON_PWR_SEQ_SERVICED_REQUEST) Indicates AON_ST wakeup has been serviced Mask */
#define AON_PWR_SEQ_SERVICED_REQUEST_AON_ST_WAKEUP AON_PWR_SEQ_SERVICED_REQUEST_AON_ST_WAKEUP_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use AON_PWR_SEQ_SERVICED_REQUEST_AON_ST_WAKEUP_Msk instead */
#define AON_PWR_SEQ_SERVICED_REQUEST_LPMCU_WAKEUP_Pos 4                                              /**< (AON_PWR_SEQ_SERVICED_REQUEST) Indicates LPMCU wakeup has been serviced Position */
#define AON_PWR_SEQ_SERVICED_REQUEST_LPMCU_WAKEUP_Msk (0x1u << AON_PWR_SEQ_SERVICED_REQUEST_LPMCU_WAKEUP_Pos)  /**< (AON_PWR_SEQ_SERVICED_REQUEST) Indicates LPMCU wakeup has been serviced Mask */
#define AON_PWR_SEQ_SERVICED_REQUEST_LPMCU_WAKEUP AON_PWR_SEQ_SERVICED_REQUEST_LPMCU_WAKEUP_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use AON_PWR_SEQ_SERVICED_REQUEST_LPMCU_WAKEUP_Msk instead */
#define AON_PWR_SEQ_SERVICED_REQUEST_BLE_ST_WAKEUP_Pos 5                                              /**< (AON_PWR_SEQ_SERVICED_REQUEST) Indicates BLE_ST wakeup has been serviced Position */
#define AON_PWR_SEQ_SERVICED_REQUEST_BLE_ST_WAKEUP_Msk (0x1u << AON_PWR_SEQ_SERVICED_REQUEST_BLE_ST_WAKEUP_Pos)  /**< (AON_PWR_SEQ_SERVICED_REQUEST) Indicates BLE_ST wakeup has been serviced Mask */
#define AON_PWR_SEQ_SERVICED_REQUEST_BLE_ST_WAKEUP AON_PWR_SEQ_SERVICED_REQUEST_BLE_ST_WAKEUP_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use AON_PWR_SEQ_SERVICED_REQUEST_BLE_ST_WAKEUP_Msk instead */
#define AON_PWR_SEQ_SERVICED_REQUEST_SLEEP_1_Pos 8                                              /**< (AON_PWR_SEQ_SERVICED_REQUEST) Indicates SLEEP 1 has been serviced Position */
#define AON_PWR_SEQ_SERVICED_REQUEST_SLEEP_1_Msk (0x1u << AON_PWR_SEQ_SERVICED_REQUEST_SLEEP_1_Pos)  /**< (AON_PWR_SEQ_SERVICED_REQUEST) Indicates SLEEP 1 has been serviced Mask */
#define AON_PWR_SEQ_SERVICED_REQUEST_SLEEP_1 AON_PWR_SEQ_SERVICED_REQUEST_SLEEP_1_Msk       /**< \deprecated Old style mask definition for 1 bit bitfield. Use AON_PWR_SEQ_SERVICED_REQUEST_SLEEP_1_Msk instead */
#define AON_PWR_SEQ_SERVICED_REQUEST_MASK   0x139u                                         /**< \deprecated (AON_PWR_SEQ_SERVICED_REQUEST) Register MASK  (Use AON_PWR_SEQ_SERVICED_REQUEST_Msk instead)  */
#define AON_PWR_SEQ_SERVICED_REQUEST_Msk    0x139u                                         /**< (AON_PWR_SEQ_SERVICED_REQUEST) Register Mask  */

/* -------- AON_PWR_SEQ_ACTIVE_REQUEST : (AON_PWR_SEQ Offset: 0x30c) (R/ 16) Active Request Status Bits -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint16_t GPIO_WAKEUP:1;             /**< bit:      0  Indicates GPIO wakeup is the active request */
    uint16_t :2;                        /**< bit:   1..2  Reserved */
    uint16_t AON_ST_WAKEUP:1;           /**< bit:      3  Indicates AON_ST wakeup is the active request */
    uint16_t LPMCU_WAKEUP:1;            /**< bit:      4  Indicates LPMCU wakeup is the active request */
    uint16_t BLE_ST_WAKEUP:1;           /**< bit:      5  Indicates BLE_ST wakeup is the active request */
    uint16_t :2;                        /**< bit:   6..7  Reserved */
    uint16_t SLEEP_1:1;                 /**< bit:      8  Indicates SLEEP 1 is the active request  */
    uint16_t :7;                        /**< bit:  9..15  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint16_t reg;                         /**< Type used for register access */
} AON_PWR_SEQ_ACTIVE_REQUEST_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define AON_PWR_SEQ_ACTIVE_REQUEST_OFFSET   0x30C                                         /**<  (AON_PWR_SEQ_ACTIVE_REQUEST) Active Request Status Bits  Offset */
#define AON_PWR_SEQ_ACTIVE_REQUEST_RESETVALUE 0x00u                                         /**<  (AON_PWR_SEQ_ACTIVE_REQUEST) Active Request Status Bits  Reset Value */

#define AON_PWR_SEQ_ACTIVE_REQUEST_GPIO_WAKEUP_Pos 0                                              /**< (AON_PWR_SEQ_ACTIVE_REQUEST) Indicates GPIO wakeup is the active request Position */
#define AON_PWR_SEQ_ACTIVE_REQUEST_GPIO_WAKEUP_Msk (0x1u << AON_PWR_SEQ_ACTIVE_REQUEST_GPIO_WAKEUP_Pos)  /**< (AON_PWR_SEQ_ACTIVE_REQUEST) Indicates GPIO wakeup is the active request Mask */
#define AON_PWR_SEQ_ACTIVE_REQUEST_GPIO_WAKEUP AON_PWR_SEQ_ACTIVE_REQUEST_GPIO_WAKEUP_Msk     /**< \deprecated Old style mask definition for 1 bit bitfield. Use AON_PWR_SEQ_ACTIVE_REQUEST_GPIO_WAKEUP_Msk instead */
#define AON_PWR_SEQ_ACTIVE_REQUEST_AON_ST_WAKEUP_Pos 3                                              /**< (AON_PWR_SEQ_ACTIVE_REQUEST) Indicates AON_ST wakeup is the active request Position */
#define AON_PWR_SEQ_ACTIVE_REQUEST_AON_ST_WAKEUP_Msk (0x1u << AON_PWR_SEQ_ACTIVE_REQUEST_AON_ST_WAKEUP_Pos)  /**< (AON_PWR_SEQ_ACTIVE_REQUEST) Indicates AON_ST wakeup is the active request Mask */
#define AON_PWR_SEQ_ACTIVE_REQUEST_AON_ST_WAKEUP AON_PWR_SEQ_ACTIVE_REQUEST_AON_ST_WAKEUP_Msk   /**< \deprecated Old style mask definition for 1 bit bitfield. Use AON_PWR_SEQ_ACTIVE_REQUEST_AON_ST_WAKEUP_Msk instead */
#define AON_PWR_SEQ_ACTIVE_REQUEST_LPMCU_WAKEUP_Pos 4                                              /**< (AON_PWR_SEQ_ACTIVE_REQUEST) Indicates LPMCU wakeup is the active request Position */
#define AON_PWR_SEQ_ACTIVE_REQUEST_LPMCU_WAKEUP_Msk (0x1u << AON_PWR_SEQ_ACTIVE_REQUEST_LPMCU_WAKEUP_Pos)  /**< (AON_PWR_SEQ_ACTIVE_REQUEST) Indicates LPMCU wakeup is the active request Mask */
#define AON_PWR_SEQ_ACTIVE_REQUEST_LPMCU_WAKEUP AON_PWR_SEQ_ACTIVE_REQUEST_LPMCU_WAKEUP_Msk    /**< \deprecated Old style mask definition for 1 bit bitfield. Use AON_PWR_SEQ_ACTIVE_REQUEST_LPMCU_WAKEUP_Msk instead */
#define AON_PWR_SEQ_ACTIVE_REQUEST_BLE_ST_WAKEUP_Pos 5                                              /**< (AON_PWR_SEQ_ACTIVE_REQUEST) Indicates BLE_ST wakeup is the active request Position */
#define AON_PWR_SEQ_ACTIVE_REQUEST_BLE_ST_WAKEUP_Msk (0x1u << AON_PWR_SEQ_ACTIVE_REQUEST_BLE_ST_WAKEUP_Pos)  /**< (AON_PWR_SEQ_ACTIVE_REQUEST) Indicates BLE_ST wakeup is the active request Mask */
#define AON_PWR_SEQ_ACTIVE_REQUEST_BLE_ST_WAKEUP AON_PWR_SEQ_ACTIVE_REQUEST_BLE_ST_WAKEUP_Msk   /**< \deprecated Old style mask definition for 1 bit bitfield. Use AON_PWR_SEQ_ACTIVE_REQUEST_BLE_ST_WAKEUP_Msk instead */
#define AON_PWR_SEQ_ACTIVE_REQUEST_SLEEP_1_Pos 8                                              /**< (AON_PWR_SEQ_ACTIVE_REQUEST) Indicates SLEEP 1 is the active request Position */
#define AON_PWR_SEQ_ACTIVE_REQUEST_SLEEP_1_Msk (0x1u << AON_PWR_SEQ_ACTIVE_REQUEST_SLEEP_1_Pos)  /**< (AON_PWR_SEQ_ACTIVE_REQUEST) Indicates SLEEP 1 is the active request Mask */
#define AON_PWR_SEQ_ACTIVE_REQUEST_SLEEP_1  AON_PWR_SEQ_ACTIVE_REQUEST_SLEEP_1_Msk         /**< \deprecated Old style mask definition for 1 bit bitfield. Use AON_PWR_SEQ_ACTIVE_REQUEST_SLEEP_1_Msk instead */
#define AON_PWR_SEQ_ACTIVE_REQUEST_MASK     0x139u                                         /**< \deprecated (AON_PWR_SEQ_ACTIVE_REQUEST) Register MASK  (Use AON_PWR_SEQ_ACTIVE_REQUEST_Msk instead)  */
#define AON_PWR_SEQ_ACTIVE_REQUEST_Msk      0x139u                                         /**< (AON_PWR_SEQ_ACTIVE_REQUEST) Register Mask  */

/* -------- AON_PWR_SEQ_LOGIC_FSM_STATES : (AON_PWR_SEQ Offset: 0x3f0) (R/ 32) Current Logic FSM States -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t MAIN_FSM_STATE:3;          /**< bit:   0..2  Main FSM State                           */
    uint32_t :5;                        /**< bit:   3..7  Reserved */
    uint32_t BLE_ON_STATE:1;            /**< bit:      8  If 1, then PD4 and PD5 are ON            */
    uint32_t BLE_OFF_STATE:1;           /**< bit:      9  If 1, then PD4 and PD5 are OFF (PD5 is in RET if set by ARM) */
    uint32_t :2;                        /**< bit: 10..11  Reserved */
    uint32_t PD6_ON_STATE:1;            /**< bit:     12  If 1, then PD6 is ON                     */
    uint32_t PD6_OFF_STATE:1;           /**< bit:     13  If 1, then PD6 is OFF                    */
    uint32_t :2;                        /**< bit: 14..15  Reserved */
    uint32_t PD7_ON_STATE:1;            /**< bit:     16  If 1, then PD7 is ON                     */
    uint32_t PD7_OFF_STATE:1;           /**< bit:     17  If 1, then PD7 is OFF                    */
    uint32_t :14;                       /**< bit: 18..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} AON_PWR_SEQ_LOGIC_FSM_STATES_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define AON_PWR_SEQ_LOGIC_FSM_STATES_OFFSET 0x3F0                                         /**<  (AON_PWR_SEQ_LOGIC_FSM_STATES) Current Logic FSM States  Offset */
#define AON_PWR_SEQ_LOGIC_FSM_STATES_RESETVALUE 0x00u                                         /**<  (AON_PWR_SEQ_LOGIC_FSM_STATES) Current Logic FSM States  Reset Value */

#define AON_PWR_SEQ_LOGIC_FSM_STATES_MAIN_FSM_STATE_Pos 0                                              /**< (AON_PWR_SEQ_LOGIC_FSM_STATES) Main FSM State Position */
#define AON_PWR_SEQ_LOGIC_FSM_STATES_MAIN_FSM_STATE_Msk (0x7u << AON_PWR_SEQ_LOGIC_FSM_STATES_MAIN_FSM_STATE_Pos)  /**< (AON_PWR_SEQ_LOGIC_FSM_STATES) Main FSM State Mask */
#define AON_PWR_SEQ_LOGIC_FSM_STATES_MAIN_FSM_STATE(value) (AON_PWR_SEQ_LOGIC_FSM_STATES_MAIN_FSM_STATE_Msk & ((value) << AON_PWR_SEQ_LOGIC_FSM_STATES_MAIN_FSM_STATE_Pos))
#define   AON_PWR_SEQ_LOGIC_FSM_STATES_MAIN_FSM_STATE_0_Val 0x0u                                           /**< (AON_PWR_SEQ_LOGIC_FSM_STATES) RESET  */
#define   AON_PWR_SEQ_LOGIC_FSM_STATES_MAIN_FSM_STATE_1_Val 0x1u                                           /**< (AON_PWR_SEQ_LOGIC_FSM_STATES) READY  */
#define   AON_PWR_SEQ_LOGIC_FSM_STATES_MAIN_FSM_STATE_2_Val 0x2u                                           /**< (AON_PWR_SEQ_LOGIC_FSM_STATES) TRANS  */
#define   AON_PWR_SEQ_LOGIC_FSM_STATES_MAIN_FSM_STATE_3_Val 0x3u                                           /**< (AON_PWR_SEQ_LOGIC_FSM_STATES) RESET_TO_READY  */
#define   AON_PWR_SEQ_LOGIC_FSM_STATES_MAIN_FSM_STATE_4_Val 0x4u                                           /**< (AON_PWR_SEQ_LOGIC_FSM_STATES) READY_TO_TRANS  */
#define   AON_PWR_SEQ_LOGIC_FSM_STATES_MAIN_FSM_STATE_5_Val 0x5u                                           /**< (AON_PWR_SEQ_LOGIC_FSM_STATES) TRANS_TO_READY  */
#define AON_PWR_SEQ_LOGIC_FSM_STATES_MAIN_FSM_STATE_0 (AON_PWR_SEQ_LOGIC_FSM_STATES_MAIN_FSM_STATE_0_Val << AON_PWR_SEQ_LOGIC_FSM_STATES_MAIN_FSM_STATE_Pos)  /**< (AON_PWR_SEQ_LOGIC_FSM_STATES) RESET Position  */
#define AON_PWR_SEQ_LOGIC_FSM_STATES_MAIN_FSM_STATE_1 (AON_PWR_SEQ_LOGIC_FSM_STATES_MAIN_FSM_STATE_1_Val << AON_PWR_SEQ_LOGIC_FSM_STATES_MAIN_FSM_STATE_Pos)  /**< (AON_PWR_SEQ_LOGIC_FSM_STATES) READY Position  */
#define AON_PWR_SEQ_LOGIC_FSM_STATES_MAIN_FSM_STATE_2 (AON_PWR_SEQ_LOGIC_FSM_STATES_MAIN_FSM_STATE_2_Val << AON_PWR_SEQ_LOGIC_FSM_STATES_MAIN_FSM_STATE_Pos)  /**< (AON_PWR_SEQ_LOGIC_FSM_STATES) TRANS Position  */
#define AON_PWR_SEQ_LOGIC_FSM_STATES_MAIN_FSM_STATE_3 (AON_PWR_SEQ_LOGIC_FSM_STATES_MAIN_FSM_STATE_3_Val << AON_PWR_SEQ_LOGIC_FSM_STATES_MAIN_FSM_STATE_Pos)  /**< (AON_PWR_SEQ_LOGIC_FSM_STATES) RESET_TO_READY Position  */
#define AON_PWR_SEQ_LOGIC_FSM_STATES_MAIN_FSM_STATE_4 (AON_PWR_SEQ_LOGIC_FSM_STATES_MAIN_FSM_STATE_4_Val << AON_PWR_SEQ_LOGIC_FSM_STATES_MAIN_FSM_STATE_Pos)  /**< (AON_PWR_SEQ_LOGIC_FSM_STATES) READY_TO_TRANS Position  */
#define AON_PWR_SEQ_LOGIC_FSM_STATES_MAIN_FSM_STATE_5 (AON_PWR_SEQ_LOGIC_FSM_STATES_MAIN_FSM_STATE_5_Val << AON_PWR_SEQ_LOGIC_FSM_STATES_MAIN_FSM_STATE_Pos)  /**< (AON_PWR_SEQ_LOGIC_FSM_STATES) TRANS_TO_READY Position  */
#define AON_PWR_SEQ_LOGIC_FSM_STATES_BLE_ON_STATE_Pos 8                                              /**< (AON_PWR_SEQ_LOGIC_FSM_STATES) If 1, then PD4 and PD5 are ON Position */
#define AON_PWR_SEQ_LOGIC_FSM_STATES_BLE_ON_STATE_Msk (0x1u << AON_PWR_SEQ_LOGIC_FSM_STATES_BLE_ON_STATE_Pos)  /**< (AON_PWR_SEQ_LOGIC_FSM_STATES) If 1, then PD4 and PD5 are ON Mask */
#define AON_PWR_SEQ_LOGIC_FSM_STATES_BLE_ON_STATE AON_PWR_SEQ_LOGIC_FSM_STATES_BLE_ON_STATE_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use AON_PWR_SEQ_LOGIC_FSM_STATES_BLE_ON_STATE_Msk instead */
#define AON_PWR_SEQ_LOGIC_FSM_STATES_BLE_OFF_STATE_Pos 9                                              /**< (AON_PWR_SEQ_LOGIC_FSM_STATES) If 1, then PD4 and PD5 are OFF (PD5 is in RET if set by ARM) Position */
#define AON_PWR_SEQ_LOGIC_FSM_STATES_BLE_OFF_STATE_Msk (0x1u << AON_PWR_SEQ_LOGIC_FSM_STATES_BLE_OFF_STATE_Pos)  /**< (AON_PWR_SEQ_LOGIC_FSM_STATES) If 1, then PD4 and PD5 are OFF (PD5 is in RET if set by ARM) Mask */
#define AON_PWR_SEQ_LOGIC_FSM_STATES_BLE_OFF_STATE AON_PWR_SEQ_LOGIC_FSM_STATES_BLE_OFF_STATE_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use AON_PWR_SEQ_LOGIC_FSM_STATES_BLE_OFF_STATE_Msk instead */
#define AON_PWR_SEQ_LOGIC_FSM_STATES_PD6_ON_STATE_Pos 12                                             /**< (AON_PWR_SEQ_LOGIC_FSM_STATES) If 1, then PD6 is ON Position */
#define AON_PWR_SEQ_LOGIC_FSM_STATES_PD6_ON_STATE_Msk (0x1u << AON_PWR_SEQ_LOGIC_FSM_STATES_PD6_ON_STATE_Pos)  /**< (AON_PWR_SEQ_LOGIC_FSM_STATES) If 1, then PD6 is ON Mask */
#define AON_PWR_SEQ_LOGIC_FSM_STATES_PD6_ON_STATE AON_PWR_SEQ_LOGIC_FSM_STATES_PD6_ON_STATE_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use AON_PWR_SEQ_LOGIC_FSM_STATES_PD6_ON_STATE_Msk instead */
#define AON_PWR_SEQ_LOGIC_FSM_STATES_PD6_OFF_STATE_Pos 13                                             /**< (AON_PWR_SEQ_LOGIC_FSM_STATES) If 1, then PD6 is OFF Position */
#define AON_PWR_SEQ_LOGIC_FSM_STATES_PD6_OFF_STATE_Msk (0x1u << AON_PWR_SEQ_LOGIC_FSM_STATES_PD6_OFF_STATE_Pos)  /**< (AON_PWR_SEQ_LOGIC_FSM_STATES) If 1, then PD6 is OFF Mask */
#define AON_PWR_SEQ_LOGIC_FSM_STATES_PD6_OFF_STATE AON_PWR_SEQ_LOGIC_FSM_STATES_PD6_OFF_STATE_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use AON_PWR_SEQ_LOGIC_FSM_STATES_PD6_OFF_STATE_Msk instead */
#define AON_PWR_SEQ_LOGIC_FSM_STATES_PD7_ON_STATE_Pos 16                                             /**< (AON_PWR_SEQ_LOGIC_FSM_STATES) If 1, then PD7 is ON Position */
#define AON_PWR_SEQ_LOGIC_FSM_STATES_PD7_ON_STATE_Msk (0x1u << AON_PWR_SEQ_LOGIC_FSM_STATES_PD7_ON_STATE_Pos)  /**< (AON_PWR_SEQ_LOGIC_FSM_STATES) If 1, then PD7 is ON Mask */
#define AON_PWR_SEQ_LOGIC_FSM_STATES_PD7_ON_STATE AON_PWR_SEQ_LOGIC_FSM_STATES_PD7_ON_STATE_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use AON_PWR_SEQ_LOGIC_FSM_STATES_PD7_ON_STATE_Msk instead */
#define AON_PWR_SEQ_LOGIC_FSM_STATES_PD7_OFF_STATE_Pos 17                                             /**< (AON_PWR_SEQ_LOGIC_FSM_STATES) If 1, then PD7 is OFF Position */
#define AON_PWR_SEQ_LOGIC_FSM_STATES_PD7_OFF_STATE_Msk (0x1u << AON_PWR_SEQ_LOGIC_FSM_STATES_PD7_OFF_STATE_Pos)  /**< (AON_PWR_SEQ_LOGIC_FSM_STATES) If 1, then PD7 is OFF Mask */
#define AON_PWR_SEQ_LOGIC_FSM_STATES_PD7_OFF_STATE AON_PWR_SEQ_LOGIC_FSM_STATES_PD7_OFF_STATE_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use AON_PWR_SEQ_LOGIC_FSM_STATES_PD7_OFF_STATE_Msk instead */
#define AON_PWR_SEQ_LOGIC_FSM_STATES_MASK   0x33307u                                       /**< \deprecated (AON_PWR_SEQ_LOGIC_FSM_STATES) Register MASK  (Use AON_PWR_SEQ_LOGIC_FSM_STATES_Msk instead)  */
#define AON_PWR_SEQ_LOGIC_FSM_STATES_Msk    0x33307u                                       /**< (AON_PWR_SEQ_LOGIC_FSM_STATES) Register Mask  */

#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
#if COMPONENT_TYPEDEF_STYLE == 'R'
/** \brief AON_PWR_SEQ hardware registers */
typedef struct {  /* Always On Power Sequencer */
  RwReg8  GPIO_WAKEUP_CTRL; /**< (AON_PWR_SEQ Offset: 0x00) Controls the wakeup enable for GPIO_0, GPIO_1 and GPIO_2 (Pinmux will control the ARM wakeup) */
  __I  uint8_t  Reserved1[11];
  RwReg8  AON_ST_WAKEUP_CTRL; /**< (AON_PWR_SEQ Offset: 0x0C) Controls the wakeup enable for the Always On Sleep Timer (AON_ST) */
  __I  uint8_t  Reserved2[3];
  RwReg16 LPMCU_WAKEUP_CTRL; /**< (AON_PWR_SEQ Offset: 0x10) Controls the wakeup enable for the Low Power Micro Controller Unit (LPMCU) */
  __I  uint8_t  Reserved3[2];
  RwReg8  BLE_ST_WAKEUP_CTRL; /**< (AON_PWR_SEQ Offset: 0x14) Controls the wakeup enable for the BLE Sleep Timer (BLE_ST) */
  __I  uint8_t  Reserved4[11];
  RwReg   LPMCU_SLEEP_1_CTRL; /**< (AON_PWR_SEQ Offset: 0x20) Controls the sleep and retention options for SLEEP request 1 from the ARM */
  __I  uint32_t Reserved5[7];
  RwReg   OFF_DELAY_0_CTRL; /**< (AON_PWR_SEQ Offset: 0x40) Power OFF Delays */
  RwReg   OFF_DELAY_1_CTRL; /**< (AON_PWR_SEQ Offset: 0x44) Power OFF Delays */
  RwReg16 ON_DELAY_0_CTRL; /**< (AON_PWR_SEQ Offset: 0x48) Power ON Delays */
  __I  uint8_t  Reserved6[2];
  RwReg   ON_DELAY_1_CTRL; /**< (AON_PWR_SEQ Offset: 0x4C) Power ON Delays */
  RwReg16 VDD_DCDC_EN_DELAY_CTRL; /**< (AON_PWR_SEQ Offset: 0x50) VDD_DCDC_EN Delay Control */
  __I  uint8_t  Reserved7[454];
  RwReg16 MISC_BYPASS_0_CTRL; /**< (AON_PWR_SEQ Offset: 0x218) Bypass control for misc signals */
  __I  uint8_t  Reserved8[230];
  RoReg8  RAW_WAKEUP_BITS; /**< (AON_PWR_SEQ Offset: 0x300) Raw Wakeup Bits */
  __I  uint8_t  Reserved9[3];
  RoReg16 PD_WAKEUP_BITS; /**< (AON_PWR_SEQ Offset: 0x304) Individual Power Domain Wakeup Bits */
  __I  uint8_t  Reserved10[2];
  RoReg16 SERVICED_REQUEST; /**< (AON_PWR_SEQ Offset: 0x308) Serviced Request Status Bits */
  __I  uint8_t  Reserved11[2];
  RoReg16 ACTIVE_REQUEST; /**< (AON_PWR_SEQ Offset: 0x30C) Active Request Status Bits */
  __I  uint8_t  Reserved12[226];
  RoReg   LOGIC_FSM_STATES; /**< (AON_PWR_SEQ Offset: 0x3F0) Current Logic FSM States */
} AonPwrSeq;

