remotemcu/remcu-chip-sdks/SAM/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/aon_pwr_seq.h
#elif COMPONENT_TYPEDEF_STYLE == 'N'
/** \brief AON_PWR_SEQ hardware registers */
typedef struct {  /* Always On Power Sequencer */
  __IO AON_PWR_SEQ_GPIO_WAKEUP_CTRL_Type GPIO_WAKEUP_CTRL; /**< Offset: 0x00 (R/W   8) Controls the wakeup enable for GPIO_0, GPIO_1 and GPIO_2 (Pinmux will control the ARM wakeup) */
       RoReg8                         Reserved1[0xB];
  __IO AON_PWR_SEQ_AON_ST_WAKEUP_CTRL_Type AON_ST_WAKEUP_CTRL; /**< Offset: 0x0C (R/W   8) Controls the wakeup enable for the Always On Sleep Timer (AON_ST) */
       RoReg8                         Reserved2[0x3];
  __IO AON_PWR_SEQ_LPMCU_WAKEUP_CTRL_Type LPMCU_WAKEUP_CTRL; /**< Offset: 0x10 (R/W  16) Controls the wakeup enable for the Low Power Micro Controller Unit (LPMCU) */
       RoReg8                         Reserved3[0x2];
  __IO AON_PWR_SEQ_BLE_ST_WAKEUP_CTRL_Type BLE_ST_WAKEUP_CTRL; /**< Offset: 0x14 (R/W   8) Controls the wakeup enable for the BLE Sleep Timer (BLE_ST) */
       RoReg8                         Reserved4[0xB];
  __IO AON_PWR_SEQ_LPMCU_SLEEP_1_CTRL_Type LPMCU_SLEEP_1_CTRL; /**< Offset: 0x20 (R/W  32) Controls the sleep and retention options for SLEEP request 1 from the ARM */
       RoReg8                         Reserved5[0x1C];
  __IO AON_PWR_SEQ_OFF_DELAY_0_CTRL_Type OFF_DELAY_0_CTRL; /**< Offset: 0x40 (R/W  32) Power OFF Delays */
  __IO AON_PWR_SEQ_OFF_DELAY_1_CTRL_Type OFF_DELAY_1_CTRL; /**< Offset: 0x44 (R/W  32) Power OFF Delays */
  __IO AON_PWR_SEQ_ON_DELAY_0_CTRL_Type ON_DELAY_0_CTRL; /**< Offset: 0x48 (R/W  16) Power ON Delays */
       RoReg8                         Reserved6[0x2];
  __IO AON_PWR_SEQ_ON_DELAY_1_CTRL_Type ON_DELAY_1_CTRL; /**< Offset: 0x4C (R/W  32) Power ON Delays */
  __IO AON_PWR_SEQ_VDD_DCDC_EN_DELAY_CTRL_Type VDD_DCDC_EN_DELAY_CTRL; /**< Offset: 0x50 (R/W  16) VDD_DCDC_EN Delay Control */
       RoReg8                         Reserved7[0x1C6];
  __IO AON_PWR_SEQ_MISC_BYPASS_0_CTRL_Type MISC_BYPASS_0_CTRL; /**< Offset: 0x218 (R/W  16) Bypass control for misc signals */
       RoReg8                         Reserved8[0xE6];
  __I  AON_PWR_SEQ_RAW_WAKEUP_BITS_Type RAW_WAKEUP_BITS; /**< Offset: 0x300 (R/    8) Raw Wakeup Bits */
       RoReg8                         Reserved9[0x3];
  __I  AON_PWR_SEQ_PD_WAKEUP_BITS_Type PD_WAKEUP_BITS; /**< Offset: 0x304 (R/   16) Individual Power Domain Wakeup Bits */
       RoReg8                         Reserved10[0x2];
  __I  AON_PWR_SEQ_SERVICED_REQUEST_Type SERVICED_REQUEST; /**< Offset: 0x308 (R/   16) Serviced Request Status Bits */
       RoReg8                         Reserved11[0x2];
  __I  AON_PWR_SEQ_ACTIVE_REQUEST_Type ACTIVE_REQUEST; /**< Offset: 0x30C (R/   16) Active Request Status Bits */
       RoReg8                         Reserved12[0xE2];
  __I  AON_PWR_SEQ_LOGIC_FSM_STATES_Type LOGIC_FSM_STATES; /**< Offset: 0x3F0 (R/   32) Current Logic FSM States */
} AonPwrSeq;

#else /* COMPONENT_TYPEDEF_STYLE */
#error Unknown component typedef style
#endif /* COMPONENT_TYPEDEF_STYLE */

#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

/** @}*/


#endif /* _SAMB11_AON_PWR_SEQ_COMPONENT_ */
